zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
/*
** ###################################################################
**     Processors:          MCXW235AIHNAR
**                          MCXW235AIUKAR
**                          MCXW235BIHNAR
**                          MCXW235BIUKAR
**                          MCXW236AIHNAR
**                          MCXW236AIUKAR
**                          MCXW236BIHNAR
**                          MCXW236BIUKAR
**
**     Version:             rev. 2.0, 2024-10-29
**     Build:               b250819
**
**     Abstract:
**         CMSIS Peripheral Access Layer for PMC
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2025 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-03-08)
**         Initial version based on v0.1UM
**     - rev. 2.0 (2024-10-29)
**         Change the device header file from single flat file to multiple files based on peripherals,
**         each peripheral with dedicated header file located in periphN folder.
**
** ###################################################################
*/

/*!
 * @file PERI_PMC.h
 * @version 2.0
 * @date 2024-10-29
 * @brief CMSIS Peripheral Access Layer for PMC
 *
 * CMSIS Peripheral Access Layer for PMC
 */

#if !defined(PERI_PMC_H_)
#define PERI_PMC_H_                              /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXW235AIHNAR) || defined(CPU_MCXW235AIUKAR) || defined(CPU_MCXW235BIHNAR) || defined(CPU_MCXW235BIUKAR))
#include "MCXW235_COMMON.h"
#elif (defined(CPU_MCXW236AIHNAR) || defined(CPU_MCXW236AIUKAR) || defined(CPU_MCXW236BIHNAR) || defined(CPU_MCXW236BIUKAR))
#include "MCXW236_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- PMC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Peripheral_Access_Layer PMC Peripheral Access Layer
 * @{
 */

/** PMC - Register Layout Typedef */
typedef struct {
  __IO uint32_t CTRL;                              /**< Power Management Control [Reset by: PoR, Pin Reset, Software Reset], offset: 0x0 */
  __I  uint32_t STATUS;                            /**< Power Management Controller FSM (Finite State Machines) status, offset: 0x4 */
  __IO uint32_t RESETCTRL;                         /**< Reset Control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x8 */
  __IO uint32_t RESETCAUSE;                        /**< Reset Cause register [Reset by: PoR], offset: 0xC */
  __IO uint32_t DCDC0;                             /**< DCDC control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0x10 */
       uint8_t RESERVED_0[4];
  __IO uint32_t BIAS;                              /**< Bias current source control register [Reset by: PoR, Pin Reset, Software Reset], offset: 0x18 */
       uint8_t RESERVED_1[4];
  __IO uint32_t LDOMEM;                            /**< LDOMEM, offset: 0x20 */
  __IO uint32_t LDODIG;                            /**< LDODIG, offset: 0x24 */
       uint8_t RESERVED_2[8];
  __IO uint32_t BOD1;                              /**< BOD1, offset: 0x30 */
  __IO uint32_t BOD2;                              /**< BOD2, offset: 0x34 */
       uint8_t RESERVED_3[8];
  __IO uint32_t FRO192M;                           /**< FRO192M, offset: 0x40 */
  __IO uint32_t FRO1M;                             /**< 1 MHz Free Running Oscillator control register, offset: 0x44 */
  __IO uint32_t FRO32K;                            /**< 32 KHz Free Running Oscillator (FRO) control register, offset: 0x48 */
  __IO uint32_t XTAL32K;                           /**< 32 KHz Crystal oscillator (XTAL) control register, offset: 0x4C */
       uint8_t RESERVED_4[4];
  __IO uint32_t XTALBLE;                           /**< BLE XTAL overrule, offset: 0x54 */
       uint8_t RESERVED_5[12];
  __IO uint32_t WAKEUPIOCTRL;                      /**< WAKEUPIOCTRL, offset: 0x64 */
  __I  uint32_t WAKEIOCAUSE;                       /**< Allows to identify the Wake-up I/O source from Deep Power Down mode, offset: 0x68 */
       uint8_t RESERVED_6[4];
  __I  uint32_t STATUSPWR;                         /**< STATUSPWR, offset: 0x70 */
  __I  uint32_t STATUSCLK;                         /**< FRO and XTAL status register [Reset by: PoR, Brown Out Detectors Reset], offset: 0x74 */
       uint8_t RESERVED_7[8];
  __IO uint32_t AOREG0;                            /**< Write-once general purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset], offset: 0x80 */
  __IO uint32_t AOREG1;                            /**< General purpose always on domain data storage [Reset by: PoR, Brown Out Detectors Reset], offset: 0x84 */
  __IO uint32_t AOREG2;                            /**< AOREG2, offset: 0x88 */
       uint8_t RESERVED_8[12];
  __IO uint32_t RTCOSC32K;                         /**< RTC 1 KHZ and 1 Hz clocks source control register [Reset by: PoR, Brown Out Detectors Reset], offset: 0x98 */
  __IO uint32_t OSTIMERr;                          /**< OS Timer control register [Reset by: PoR, Brown Out Detectors Reset], offset: 0x9C, 'r' suffix has been added to avoid a clash with peripheral base pointer macro 'OSTIMER' */
       uint8_t RESERVED_9[4];
  __IO uint32_t TIMEOUTEVENTS;                     /**< Record time-out errors that might occur at different stages during IC power up, offset: 0xA4 */
  __IO uint32_t TIMEOUT;                           /**< TIMEOUT, offset: 0xA8 */
       uint8_t RESERVED_10[4];
  __IO uint32_t PDSLEEPCFG0;                       /**< Controls the power to various modules during Low Power modes - DEEP SLEEP, POWER DOWN and DEEP POWER DOWN [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xB0 */
  __IO uint32_t SRAMRETCTRL;                       /**< SRAMRETCTRL, offset: 0xB4 */
  __IO uint32_t PDRUNCFG0;                         /**< PDRUNCFG0, offset: 0xB8 */
       uint8_t RESERVED_11[4];
  __O  uint32_t PDRUNCFGSET0;                      /**< Controls the power to various analog blocks [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0xC0 */
       uint8_t RESERVED_12[4];
  __O  uint32_t PDRUNCFGCLR0;                      /**< Controls the power to various analog blocks [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0xC8 */
       uint8_t RESERVED_13[4];
  __IO uint32_t ROMCTRL;                           /**< ROM control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset], offset: 0xD0 */
  __IO uint32_t SRAMCTRL;                          /**< All SRAMs common control signals [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset], offset: 0xD4 */
  __IO uint32_t SRAMCTRL0;                         /**< RAMX0 to RAM20 power modes controls [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] When [LS, LSDEL, DSB, DSBDEL] is: 0011 : Normal Mode 1111 : Light sleep mode 0100 : Deep-sleep mode 1100 : Shut down Mode, offset: 0xD8 */
  __IO uint32_t SRAMCTRL1;                         /**< BLE RAM power mode controls, offset: 0xDC */
  __IO uint32_t SRAMASSISTCTRL0;                   /**< SRAMASSISTCTRL0, offset: 0xE0 */
  __IO uint32_t SRAMASSISTCTRL1;                   /**< SRAMASSISTCTRL1, offset: 0xE4 */
       uint8_t RESERVED_14[16];
  __IO uint32_t DFTENDIS;                          /**< DFTENDIS, offset: 0xF8 */
  __IO uint32_t DFTDCDC;                           /**< DFTDCDC, offset: 0xFC */
  __IO uint32_t DFTCAPTEST;                        /**< DFTCAPTEST, offset: 0x100 */
} PMC_Type;

/* ----------------------------------------------------------------------------
   -- PMC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup PMC_Register_Masks PMC Register Masks
 * @{
 */

/*! @name CTRL - Power Management Control [Reset by: PoR, Pin Reset, Software Reset] */
/*! @{ */

#define PMC_CTRL_LPMODE_MASK                     (0x3U)
#define PMC_CTRL_LPMODE_SHIFT                    (0U)
/*! LPMODE - Power Mode Control.
 *  0b00..ACTIVE power mode.
 *  0b01..DEEP SLEEP low power mode.
 *  0b10..POWER DOWN low power mode.
 *  0b11..DEEP POWER DOWN low power mode.
 */
#define PMC_CTRL_LPMODE(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_LPMODE_SHIFT)) & PMC_CTRL_LPMODE_MASK)

#define PMC_CTRL_SELCLOCK_MASK                   (0xCU)
#define PMC_CTRL_SELCLOCK_SHIFT                  (2U)
/*! SELCLOCK - Select the Power Management Controller (PMC) functional clock : .
 *  0b00..1 MHz Free Running Oscillator.
 *  0b01..12 MHz Free Running Oscillator.
 *  0b10..32kHz RTC clock.
 */
#define PMC_CTRL_SELCLOCK(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_SELCLOCK_SHIFT)) & PMC_CTRL_SELCLOCK_MASK)

