zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_CTRL_POFFMODE_MASK                   (0x10U)
#define PMC_CTRL_POFFMODE_SHIFT                  (4U)
/*! POFFMODE - Power Off Mode Control
 *  0b0..Power Mode defined by LPMODE
 *  0b1..PowerOff
 */
#define PMC_CTRL_POFFMODE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_CTRL_POFFMODE_SHIFT)) & PMC_CTRL_POFFMODE_MASK)
/*! @} */

/*! @name STATUS - Power Management Controller FSM (Finite State Machines) status */
/*! @{ */

#define PMC_STATUS_FSMMAIN_MASK                  (0x7U)
#define PMC_STATUS_FSMMAIN_SHIFT                 (0U)
/*! FSMMAIN - Power Management Controller Main Finite State Machine (FSM) status
 *  0b000..POWER UP : The IC is powering up.
 *  0b001..ACTIVE : Power up is completed. The IC is in normal functional operation mode..
 *  0b010..DEEP SLEEP: The IC has entered DEEP SLEEP mode.
 *  0b011..SLEEP : the IC has entered SLEEP mode.
 *  0b100..IC Structural TEST Mode : The IC has entered in IC Test mode.
 *  0b101..POWERDOWN: The IC has entered POWER OFF mode.
 *  0b110..POWERDOWN: The IC has entered POWER DOWN mode.
 *  0b111..DEEP POWER DOWN : The IC entred DEEP POWER DOWN mode.
 */
#define PMC_STATUS_FSMMAIN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMMAIN_SHIFT)) & PMC_STATUS_FSMMAIN_MASK)

#define PMC_STATUS_FSMPWUP_MASK                  (0x78U)
#define PMC_STATUS_FSMPWUP_SHIFT                 (3U)
/*! FSMPWUP - POWER UP Finite State Machine (FSM) status
 *  0b0000..RESET : The IC is powering up - reset state.
 *  0b0001..ENABLE_DCDC : The IC is powering up - enable DCDC.
 *  0b0010..SWITCH_DOMAINS : The IC is powering up - switch domains.
 *  0b0011..ENABLE_LDO : The IC is powering up - enable LDO.
 *  0b0100..ACTIVATE_MEM : The IC is powering up - activate memories
 *  0b0101..RELEASE_ISOLATIONS : The IC is powering up - release isolations
 *  0b0110..ENA_FLASH : The IC is powering up - enable flash
 *  0b0111..WAIT_FRO192M : The IC is powering up - wait on FRO192M
 *  0b1010..DONE : The IC is powering up - done
 *  0b1100..RELEASE_RESET : The IC is powering up - release reset
 *  0b1101..TRANSFER_TRIM : The IC is powering up - transfer trim
 *  0b1110..SWITCH_CLOCK : The IC is powering up - switch clock
 *  0b1111..RELEASE_CPU : The IC is powering up - release CPU
 */
#define PMC_STATUS_FSMPWUP(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMPWUP_SHIFT)) & PMC_STATUS_FSMPWUP_MASK)

#define PMC_STATUS_FSMDSLP_MASK                  (0x780U)
#define PMC_STATUS_FSMDSLP_SHIFT                 (7U)
/*! FSMDSLP - DEEP SLEEP Finite State Machine (FSM) status
 *  0b0000..IDLE : The IC is entering deep sleep - idle state.
 *  0b0001..PREPARE : The IC is entering deep sleep - prepare.
 *  0b0010..DISABLE_FRO : The IC is entering deep sleep - disable FRO.
 *  0b0011..SWITCH_TO_DEEPSLEEP : The IC is entering deep sleep - switch to deepsleep.
 *  0b0100..ENABLE_LDO : The IC is exiting deep sleep - enable LDO.
 *  0b0101..ENABLE_DCDC : The IC is exiting deep sleep - enable DCDC.
 *  0b0110..DONE : The IC is entering deep sleep - done.
 *  0b0111..PWRUP_BG : The IC is exiting deep sleep - power-up bandgap.
 *  0b1010..PWRUP_DONE : The IC is exiting deep sleep - power-up done.
 *  0b1100..SWITCH_DOMAINS : The IC is exiting deep sleep - switch domains.
 *  0b1101..ENABLE_FLASH : The IC is exiting deep sleep - enable flash.
 *  0b1110..ACTIVATE_SRAM : The IC is exiting deep sleep - activate SRAM.
 *  0b1111..PWUP_WAIT_FRO192M : The IC is exiting deep sleep - wait on FRO192M.
 */
#define PMC_STATUS_FSMDSLP(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMDSLP_SHIFT)) & PMC_STATUS_FSMDSLP_MASK)

#define PMC_STATUS_FSMPWDN_MASK                  (0x7800U)
#define PMC_STATUS_FSMPWDN_SHIFT                 (11U)
/*! FSMPWDN - POWER DOWN Finite State Machine (FSM) status
 *  0b0000..IDLE : The IC is entering power down - idle state.
 *  0b0001..DISABLE : The IC is entering power down - disable.
 *  0b0010..POWER_SHUTOFF : The IC is entering power down - power shutoff.
 *  0b0011..SHUTOFF : The IC is entering power down - shutoff.
 *  0b0100..PWRUP_ENABLE_DCDC : The IC is exiting power down - enable DCDC.
 *  0b0101..PWRUP_BG : The IC is exiting power down - power-up bandgap.
 *  0b0110..DISABLE_FRO : The IC is entering power down - disable FRO.
 *  0b0111..DONE : The IC is entering power down - done.
 *  0b1010..PWRUP_INIT_FLASH : The IC is exiting power down - power-up flash initialization.
 *  0b1011..PWRUP_DONE : The IC is exiting deep sleep - power-up done.
 *  0b1100..PWRUP_ENABLE_LDO : The IC is exiting power down - enable LDO.
 *  0b1101..PWUP_SWITCH_DOMAINS : The IC is exiting power down - power-up switch domains.
 *  0b1110..PWRUP_RELEASE_ISOLATION : The IC is exiting power down - power-up release isolation.
 *  0b1111..PWRUP_WAIT_FRO192M : The IC is exiting power down - power-up wait for FRO192M.
 */
#define PMC_STATUS_FSMPWDN(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMPWDN_SHIFT)) & PMC_STATUS_FSMPWDN_MASK)

#define PMC_STATUS_FSMDPWD_MASK                  (0x38000U)
#define PMC_STATUS_FSMDPWD_SHIFT                 (15U)
/*! FSMDPWD - DEEP POWER DOWN Finite State Machine (FSM) status
 *  0b000..INIT : The IC is entering deep power down - initialization.
 *  0b001..POWER_SHUTOFF : The IC is entering deep power down - power shutoff.
 *  0b010..DONE : The IC is entering deep power down - done.
 *  0b011..DISABLE_FRO : The IC is entering deep power down - disable FRO.
 */
#define PMC_STATUS_FSMDPWD(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMDPWD_SHIFT)) & PMC_STATUS_FSMDPWD_MASK)

#define PMC_STATUS_BOOTMODE_MASK                 (0xC0000U)
#define PMC_STATUS_BOOTMODE_SHIFT                (18U)
/*! BOOTMODE - Latest IC Boot cause:.
 *  0b00..Latest IC boot was a Full power cycle boot sequence (PoR, Pin Reset, Brown Out Detectors Reset, Software Reset).
 *  0b01..Latest IC boot was from DEEP SLEEP low power mode.
 *  0b10..Latest IC boot was from POWER DOWN low power mode.
 *  0b11..Latest IC boot was from DEEP POWER DOWN low power mode.
 */
#define PMC_STATUS_BOOTMODE(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_BOOTMODE_SHIFT)) & PMC_STATUS_BOOTMODE_MASK)

#define PMC_STATUS_FSMBLESTATE_MASK              (0x1F00000U)
#define PMC_STATUS_FSMBLESTATE_SHIFT             (20U)
/*! FSMBLESTATE - Bluetooth Low Energy Finite State Machine (FSM) status
 *  0b00000..BLE Power FSM : Reset
 *  0b00001..BLE Power FSM : Link layer and memory enable
 *  0b00010..BLE Power FSM : Enable clock out
 *  0b00011..BLE Power FSM : Enable oscillator
 *  0b00100..BLE Power FSM : Low Power Mode - link Layer deep sleep and phy shutdown
 *  0b00101..BLE Power FSM : Low Power Mode disable oscillator
 *  0b00110..BLE Power FSM : Radio active
 *  0b00111..BLE Power FSM : Low Power Mode assert isolations and resets
 *  0b01000..BLE Power FSM : Power off mode - trigger hresetn
 *  0b01001..BLE Power FSM : Power off mode - radio restart
 *  0b01010..BLE Power FSM : Power off mode - remove power
 *  0b01011..BLE Power FSM : Power off mode - radio off
 *  0b01100..BLE Power FSM : Low Power Mode - radio restart
 *  0b01101..BLE Power FSM : Low Power Mode - enable oscillator
 *  0b01110..BLE Power FSM : Power off mode - assert isolation and resets
 *  0b01111..BLE Power FSM : Low Power Mode - enable clock output
 *  0b11000..BLE Power FSM : Power off mode - enable oscillator
 *  0b11001..BLE Power FSM : Power off mode - enable clock out
 */
#define PMC_STATUS_FSMBLESTATE(x)                (((uint32_t)(((uint32_t)(x)) << PMC_STATUS_FSMBLESTATE_SHIFT)) & PMC_STATUS_FSMBLESTATE_MASK)
/*! @} */

/*! @name RESETCTRL - Reset Control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] */
/*! @{ */

#define PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK  (0x1U)
#define PMC_RESETCTRL_DPDWAKEUPRESETENABLE_SHIFT (0U)
/*! DPDWAKEUPRESETENABLE - Wake-up from DEEP POWER DOWN reset event (either from wake up I/O or RTC enable).
 *  0b0..Reset event from DEEP POWER DOWN mode is disable.
 *  0b1..Reset event from DEEP POWER DOWN mode is enable.
 */
#define PMC_RESETCTRL_DPDWAKEUPRESETENABLE(x)    (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_DPDWAKEUPRESETENABLE_SHIFT)) & PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK)

#define PMC_RESETCTRL_SWRRESETENABLE_MASK        (0x8U)
#define PMC_RESETCTRL_SWRRESETENABLE_SHIFT       (3U)
/*! SWRRESETENABLE - Software reset enable.
 *  0b0..Software reset is disable.
 *  0b1..Software reset is enable.
 */
#define PMC_RESETCTRL_SWRRESETENABLE(x)          (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_SWRRESETENABLE_SHIFT)) & PMC_RESETCTRL_SWRRESETENABLE_MASK)

#define PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK   (0x30U)
#define PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT  (4U)
/*! BOD1RESETENA_SECURE - BOD1 reset enable.
 *  0b01..Any other value than b10, BOD1 reset is enable.
 *  0b10..BOD1 reset is disable.
 */
#define PMC_RESETCTRL_BOD1RESETENA_SECURE(x)     (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT)) & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK)

