zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK   (0xC0U)
#define PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT  (6U)
/*! BOD2RESETENA_SECURE - BOD2 reset enable.
 *  0b01..Any other value than b10, BOD2 reset is enable.
 *  0b10..BOD2 reset is disable.
 */
#define PMC_RESETCTRL_BOD2RESETENA_SECURE(x)     (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT)) & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK)

#define PMC_RESETCTRL_CRCERRORRESETENABLE_MASK   (0x100U)
#define PMC_RESETCTRL_CRCERRORRESETENABLE_SHIFT  (8U)
/*! CRCERRORRESETENABLE - CPU retention CRC error reset enable.
 *  0b0..CPU retention CRC error reset is disable.
 *  0b1..CPU retention CRC error reset is enable.
 */
#define PMC_RESETCTRL_CRCERRORRESETENABLE(x)     (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_CRCERRORRESETENABLE_SHIFT)) & PMC_RESETCTRL_CRCERRORRESETENABLE_MASK)

#define PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK (0x30000000U)
#define PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT (28U)
/*! BOD1RESETENA_SECURE_DP - BOD1 reset enable.
 *  0b01..Any other value than b10, BOD1 reset is enable.
 *  0b10..BOD1 reset is disable.
 */
#define PMC_RESETCTRL_BOD1RESETENA_SECURE_DP(x)  (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT)) & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK)

#define PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK (0xC0000000U)
#define PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT (30U)
/*! BOD2RESETENA_SECURE_DP - BOD2 reset enable.
 *  0b01..Any other value than b10, BOD2 reset is enable.
 *  0b10..BOD2 reset is disable.
 */
#define PMC_RESETCTRL_BOD2RESETENA_SECURE_DP(x)  (((uint32_t)(((uint32_t)(x)) << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT)) & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK)
/*! @} */

/*! @name RESETCAUSE - Reset Cause register [Reset by: PoR] */
/*! @{ */

#define PMC_RESETCAUSE_POR_MASK                  (0x1U)
#define PMC_RESETCAUSE_POR_SHIFT                 (0U)
/*! POR - 1 : The last chip reset was caused by a Power On Reset. Write '1' to clear this bit. */
#define PMC_RESETCAUSE_POR(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_POR_SHIFT)) & PMC_RESETCAUSE_POR_MASK)

#define PMC_RESETCAUSE_PADRESET_MASK             (0x2U)
#define PMC_RESETCAUSE_PADRESET_SHIFT            (1U)
/*! PADRESET - 1 : The last chip reset was caused by a Pin Reset. */
#define PMC_RESETCAUSE_PADRESET(x)               (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_PADRESET_SHIFT)) & PMC_RESETCAUSE_PADRESET_MASK)

#define PMC_RESETCAUSE_BODRESET_MASK             (0x4U)
#define PMC_RESETCAUSE_BODRESET_SHIFT            (2U)
/*! BODRESET - 1 : The last chip reset was caused by a Brown Out Detector. */
#define PMC_RESETCAUSE_BODRESET(x)               (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_BODRESET_SHIFT)) & PMC_RESETCAUSE_BODRESET_MASK)

#define PMC_RESETCAUSE_SYSTEMRESET_MASK          (0x8U)
#define PMC_RESETCAUSE_SYSTEMRESET_SHIFT         (3U)
/*! SYSTEMRESET - 1 : The last chip reset was caused by a System Reset requested by the ARM CPU. */
#define PMC_RESETCAUSE_SYSTEMRESET(x)            (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_SYSTEMRESET_SHIFT)) & PMC_RESETCAUSE_SYSTEMRESET_MASK)

#define PMC_RESETCAUSE_WDTRESET_MASK             (0x10U)
#define PMC_RESETCAUSE_WDTRESET_SHIFT            (4U)
/*! WDTRESET - 1 : The last chip reset was caused by the Watchdog Timer. */
#define PMC_RESETCAUSE_WDTRESET(x)               (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_WDTRESET_SHIFT)) & PMC_RESETCAUSE_WDTRESET_MASK)

#define PMC_RESETCAUSE_SWRRESET_MASK             (0x20U)
#define PMC_RESETCAUSE_SWRRESET_SHIFT            (5U)
/*! SWRRESET - 1 : The last chip reset was caused by a Software reset. */
#define PMC_RESETCAUSE_SWRRESET(x)               (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_SWRRESET_SHIFT)) & PMC_RESETCAUSE_SWRRESET_MASK)

#define PMC_RESETCAUSE_DPDRESET_WAKEUPIO_MASK    (0x40U)
#define PMC_RESETCAUSE_DPDRESET_WAKEUPIO_SHIFT   (6U)
/*! DPDRESET_WAKEUPIO - 1 : The last chip reset was caused by a Wake-up I/O reset event during DEEP POWER DOWN mode. */
#define PMC_RESETCAUSE_DPDRESET_WAKEUPIO(x)      (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_DPDRESET_WAKEUPIO_SHIFT)) & PMC_RESETCAUSE_DPDRESET_WAKEUPIO_MASK)

#define PMC_RESETCAUSE_DPDRESET_RTC_MASK         (0x80U)
#define PMC_RESETCAUSE_DPDRESET_RTC_SHIFT        (7U)
/*! DPDRESET_RTC - 1 : The last chip reset was caused by RTC. */
#define PMC_RESETCAUSE_DPDRESET_RTC(x)           (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_DPDRESET_RTC_SHIFT)) & PMC_RESETCAUSE_DPDRESET_RTC_MASK)

#define PMC_RESETCAUSE_DPDRESET_OSTIMER_MASK     (0x100U)
#define PMC_RESETCAUSE_DPDRESET_OSTIMER_SHIFT    (8U)
/*! DPDRESET_OSTIMER - 1 : The last chip reset was caused by OS Event Timer reset event during DEEP POWER DOWN mode. */
#define PMC_RESETCAUSE_DPDRESET_OSTIMER(x)       (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_DPDRESET_OSTIMER_SHIFT)) & PMC_RESETCAUSE_DPDRESET_OSTIMER_MASK)

#define PMC_RESETCAUSE_CDOGRESET_MASK            (0x200U)
#define PMC_RESETCAUSE_CDOGRESET_SHIFT           (9U)
/*! CDOGRESET - 1 : The last chip reset was caused by the code Watchdog. */
#define PMC_RESETCAUSE_CDOGRESET(x)              (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_CDOGRESET_SHIFT)) & PMC_RESETCAUSE_CDOGRESET_MASK)

#define PMC_RESETCAUSE_BLEWUP_MASK               (0x400U)
#define PMC_RESETCAUSE_BLEWUP_SHIFT              (10U)
/*! BLEWUP - 1 : The last chip wakeup was caused by the BLE Timer wakeup. */
#define PMC_RESETCAUSE_BLEWUP(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_BLEWUP_SHIFT)) & PMC_RESETCAUSE_BLEWUP_MASK)

#define PMC_RESETCAUSE_CRCERROR_MASK             (0x800U)
#define PMC_RESETCAUSE_CRCERROR_SHIFT            (11U)
/*! CRCERROR - 1 : The last chip reset was caused by a CRC error during CPU state retention restore. */
#define PMC_RESETCAUSE_CRCERROR(x)               (((uint32_t)(((uint32_t)(x)) << PMC_RESETCAUSE_CRCERROR_SHIFT)) & PMC_RESETCAUSE_CRCERROR_MASK)
/*! @} */

