zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
/*! @name DCDC0 - DCDC control register [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] */
/*! @{ */

#define PMC_DCDC0_VOLTAGE_MASK                   (0xFU)
#define PMC_DCDC0_VOLTAGE_SHIFT                  (0U)
/*! VOLTAGE - DCDC output voltage level */
#define PMC_DCDC0_VOLTAGE(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_VOLTAGE_SHIFT)) & PMC_DCDC0_VOLTAGE_MASK)

#define PMC_DCDC0_RC_MASK                        (0xF0U)
#define PMC_DCDC0_RC_SHIFT                       (4U)
/*! RC - Calibration RC time for Buck mode */
#define PMC_DCDC0_RC(x)                          (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_RC_SHIFT)) & PMC_DCDC0_RC_MASK)

#define PMC_DCDC0_INDUCTOR_MASK                  (0x3000U)
#define PMC_DCDC0_INDUCTOR_SHIFT                 (12U)
/*! INDUCTOR - Scale current mirror
 *  0b00..1.0 uH
 *  0b01..2.2 uH
 *  0b10..4.7 uH
 */
#define PMC_DCDC0_INDUCTOR(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_INDUCTOR_SHIFT)) & PMC_DCDC0_INDUCTOR_MASK)

#define PMC_DCDC0_PASSTHROUGH_EN_MASK            (0x4000U)
#define PMC_DCDC0_PASSTHROUGH_EN_SHIFT           (14U)
/*! PASSTHROUGH_EN - Enable pass through 0: disabled 1: enabled */
#define PMC_DCDC0_PASSTHROUGH_EN(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_PASSTHROUGH_EN_SHIFT)) & PMC_DCDC0_PASSTHROUGH_EN_MASK)

#define PMC_DCDC0_TRIMNZCD_MASK                  (0x38000U)
#define PMC_DCDC0_TRIMNZCD_SHIFT                 (15U)
/*! TRIMNZCD - Trim bits N-ZCD */
#define PMC_DCDC0_TRIMNZCD(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_TRIMNZCD_SHIFT)) & PMC_DCDC0_TRIMNZCD_MASK)

#define PMC_DCDC0_TRIMPZCD_MASK                  (0x1C0000U)
#define PMC_DCDC0_TRIMPZCD_SHIFT                 (18U)
/*! TRIMPZCD - Trim bits P-ZCD */
#define PMC_DCDC0_TRIMPZCD(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_TRIMPZCD_SHIFT)) & PMC_DCDC0_TRIMPZCD_MASK)

#define PMC_DCDC0_ENABLE_BYPASS_MASK             (0x200000U)
#define PMC_DCDC0_ENABLE_BYPASS_SHIFT            (21U)
/*! ENABLE_BYPASS - Enable low power bypass switch */
#define PMC_DCDC0_ENABLE_BYPASS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_ENABLE_BYPASS_SHIFT)) & PMC_DCDC0_ENABLE_BYPASS_MASK)

#define PMC_DCDC0_ROBUST_STARTUP_DISABLE_MASK    (0x400000U)
#define PMC_DCDC0_ROBUST_STARTUP_DISABLE_SHIFT   (22U)
/*! ROBUST_STARTUP_DISABLE - Block BOD controlled DCDC buck and boost control */
#define PMC_DCDC0_ROBUST_STARTUP_DISABLE(x)      (((uint32_t)(((uint32_t)(x)) << PMC_DCDC0_ROBUST_STARTUP_DISABLE_SHIFT)) & PMC_DCDC0_ROBUST_STARTUP_DISABLE_MASK)
/*! @} */

/*! @name BIAS - Bias current source control register [Reset by: PoR, Pin Reset, Software Reset] */
/*! @{ */

#define PMC_BIAS_DCSHIFT_MASK                    (0x1FU)
#define PMC_BIAS_DCSHIFT_SHIFT                   (0U)
/*! DCSHIFT - Trimming bits to adjust DC shift */
#define PMC_BIAS_DCSHIFT(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_BIAS_DCSHIFT_SHIFT)) & PMC_BIAS_DCSHIFT_MASK)

#define PMC_BIAS_CURVE_MASK                      (0x60U)
#define PMC_BIAS_CURVE_SHIFT                     (5U)
/*! CURVE - Trimming bits to adjust deviations in curvature on silicon */
#define PMC_BIAS_CURVE(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_BIAS_CURVE_SHIFT)) & PMC_BIAS_CURVE_MASK)

#define PMC_BIAS_IREFTRIM_MASK                   (0xF80U)
#define PMC_BIAS_IREFTRIM_SHIFT                  (7U)
/*! IREFTRIM - Bias current trimming */
#define PMC_BIAS_IREFTRIM(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_BIAS_IREFTRIM_SHIFT)) & PMC_BIAS_IREFTRIM_MASK)

#define PMC_BIAS_LPDCSHIFT_MASK                  (0xF000U)
#define PMC_BIAS_LPDCSHIFT_SHIFT                 (12U)
/*! LPDCSHIFT - Trimming bits to adjust DC shift in low power mode */
#define PMC_BIAS_LPDCSHIFT(x)                    (((uint32_t)(((uint32_t)(x)) << PMC_BIAS_LPDCSHIFT_SHIFT)) & PMC_BIAS_LPDCSHIFT_MASK)
/*! @} */

/*! @name LDOMEM - LDOMEM */
/*! @{ */

#define PMC_LDOMEM_VADJ_MASK                     (0xFU)
#define PMC_LDOMEM_VADJ_SHIFT                    (0U)
/*! VADJ - Sets the LDO output level (4 bit, only 2 LSB used). */
#define PMC_LDOMEM_VADJ(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_LDOMEM_VADJ_SHIFT)) & PMC_LDOMEM_VADJ_MASK)

#define PMC_LDOMEM_VADJ_PWD_MASK                 (0x10U)
#define PMC_LDOMEM_VADJ_PWD_SHIFT                (4U)
/*! VADJ_PWD - Sets the LDO output level to 0.63V or 0.66V in low power mode */
#define PMC_LDOMEM_VADJ_PWD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_LDOMEM_VADJ_PWD_SHIFT)) & PMC_LDOMEM_VADJ_PWD_MASK)
/*! @} */

/*! @name LDODIG - LDODIG */
/*! @{ */

#define PMC_LDODIG_VADJ_MASK                     (0xFU)
#define PMC_LDODIG_VADJ_SHIFT                    (0U)
/*! VADJ - Sets the LDO output level (4 bit, only 2 LSB used). */
#define PMC_LDODIG_VADJ(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_LDODIG_VADJ_SHIFT)) & PMC_LDODIG_VADJ_MASK)

#define PMC_LDODIG_VADJ_PWD_MASK                 (0x10U)
#define PMC_LDODIG_VADJ_PWD_SHIFT                (4U)
/*! VADJ_PWD - Sets the LDO output level to 0.63V or 0.66V in low power mode */
#define PMC_LDODIG_VADJ_PWD(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_LDODIG_VADJ_PWD_SHIFT)) & PMC_LDODIG_VADJ_PWD_MASK)
/*! @} */

/*! @name BOD1 - BOD1 */
/*! @{ */

#define PMC_BOD1_TRIGLVL_MASK                    (0x1FU)
#define PMC_BOD1_TRIGLVL_SHIFT                   (0U)
/*! TRIGLVL - BOD Trigger level
 *  0b00000..1.00 V.
 *  0b00001..1.05 V.
 *  0b00010..1.10 V.
 *  0b00011..1.15 V.
 *  0b00100..1.20 V.
 *  0b00101..1.25 V.
 *  0b00110..1.30 V.
 *  0b00111..1.35 V.
 *  0b01000..1.40 V.
 *  0b01001..1.45 V.
 *  0b01010..1.50 V.
 *  0b01011..1.60 V.
 *  0b01100..1.70 V.
 *  0b01101..1.80 V.
 *  0b01110..1.90 V.
 *  0b01111..2.00 V.
 *  0b10000..2.10 V.
 *  0b10001..2.20 V.
 *  0b10010..2.30 V.
 *  0b10011..2.40 V.
 *  0b10100..2.50 V.
 *  0b10101..2.60 V.
 *  0b10110..2.70 V.
 *  0b10111..2.80 V.
 *  0b11000..2.90 V.
 *  0b11001..3.00 V.
 *  0b11010..3.10 V.
 */
#define PMC_BOD1_TRIGLVL(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_BOD1_TRIGLVL_SHIFT)) & PMC_BOD1_TRIGLVL_MASK)

#define PMC_BOD1_HYST_MASK                       (0x60U)
#define PMC_BOD1_HYST_SHIFT                      (5U)
/*! HYST - BOD Hysteresis control
 *  0b00..25 mV.
 *  0b01..50 mV.
 *  0b10..75 mV.
 *  0b11..100 mV.
 */
#define PMC_BOD1_HYST(x)                         (((uint32_t)(((uint32_t)(x)) << PMC_BOD1_HYST_SHIFT)) & PMC_BOD1_HYST_MASK)

