zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_BOD1_MODE_MASK                       (0x80U)
#define PMC_BOD1_MODE_SHIFT                      (7U)
/*! MODE - BOD Operation mode select
 *  0b0..Level detector mode
 *  0b1..BOD mode
 */
#define PMC_BOD1_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << PMC_BOD1_MODE_SHIFT)) & PMC_BOD1_MODE_MASK)

#define PMC_BOD1_LVLSEL_MASK                     (0x100U)
#define PMC_BOD1_LVLSEL_SHIFT                    (8U)
/*! LVLSEL - BOD Level select when mode is set to zero
 *  0b0..Reference is sum of threshold plus hysteresis
 *  0b1..Reference is threshold
 */
#define PMC_BOD1_LVLSEL(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_BOD1_LVLSEL_SHIFT)) & PMC_BOD1_LVLSEL_MASK)
/*! @} */

/*! @name BOD2 - BOD2 */
/*! @{ */

#define PMC_BOD2_TRIGLVL_MASK                    (0x1FU)
#define PMC_BOD2_TRIGLVL_SHIFT                   (0U)
/*! TRIGLVL - BOD Trigger level
 *  0b00000..1.00 V.
 *  0b00001..1.05 V.
 *  0b00010..1.10 V.
 *  0b00011..1.15 V.
 *  0b00100..1.20 V.
 *  0b00101..1.25 V.
 *  0b00110..1.30 V.
 *  0b00111..1.35 V.
 *  0b01000..1.40 V.
 *  0b01001..1.45 V.
 *  0b01010..1.50 V.
 *  0b01011..1.60 V.
 *  0b01100..1.70 V.
 *  0b01101..1.80 V.
 *  0b01110..1.90 V.
 *  0b01111..2.00 V.
 *  0b10000..2.10 V.
 *  0b10001..2.20 V.
 *  0b10010..2.30 V.
 *  0b10011..2.40 V.
 *  0b10100..2.50 V.
 *  0b10101..2.60 V.
 *  0b10110..2.70 V.
 *  0b10111..2.80 V.
 *  0b11000..2.90 V.
 *  0b11001..3.00 V.
 *  0b11010..3.10 V.
 */
#define PMC_BOD2_TRIGLVL(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_BOD2_TRIGLVL_SHIFT)) & PMC_BOD2_TRIGLVL_MASK)

#define PMC_BOD2_HYST_MASK                       (0x60U)
#define PMC_BOD2_HYST_SHIFT                      (5U)
/*! HYST - BOD Hysteresis control
 *  0b00..25 mV.
 *  0b01..50 mV.
 *  0b10..75 mV.
 *  0b11..100 mV.
 */
#define PMC_BOD2_HYST(x)                         (((uint32_t)(((uint32_t)(x)) << PMC_BOD2_HYST_SHIFT)) & PMC_BOD2_HYST_MASK)

#define PMC_BOD2_MODE_MASK                       (0x80U)
#define PMC_BOD2_MODE_SHIFT                      (7U)
/*! MODE - BOD Operation mode select
 *  0b0..Level detector mode
 *  0b1..BOD mode
 */
#define PMC_BOD2_MODE(x)                         (((uint32_t)(((uint32_t)(x)) << PMC_BOD2_MODE_SHIFT)) & PMC_BOD2_MODE_MASK)

#define PMC_BOD2_LVLSEL_MASK                     (0x100U)
#define PMC_BOD2_LVLSEL_SHIFT                    (8U)
/*! LVLSEL - BOD Level select when mode is set to zero
 *  0b0..Reference is sum of threshold plus hysteresis
 *  0b1..Reference is threshold
 */
#define PMC_BOD2_LVLSEL(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_BOD2_LVLSEL_SHIFT)) & PMC_BOD2_LVLSEL_MASK)
/*! @} */

/*! @name FRO192M - FRO192M */
/*! @{ */

#define PMC_FRO192M_BIAS_MASK                    (0x3FU)
#define PMC_FRO192M_BIAS_SHIFT                   (0U)
/*! BIAS - Coarse frequency trimming */
#define PMC_FRO192M_BIAS(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_FRO192M_BIAS_SHIFT)) & PMC_FRO192M_BIAS_MASK)

#define PMC_FRO192M_CUR_DAC_MASK                 (0x3FC0U)
#define PMC_FRO192M_CUR_DAC_SHIFT                (6U)
/*! CUR_DAC - Fine frequency trimming */
#define PMC_FRO192M_CUR_DAC(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_FRO192M_CUR_DAC_SHIFT)) & PMC_FRO192M_CUR_DAC_MASK)

#define PMC_FRO192M_TC_MASK                      (0xFC000U)
#define PMC_FRO192M_TC_SHIFT                     (14U)
/*! TC - Temperature compensation */
#define PMC_FRO192M_TC(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_FRO192M_TC_SHIFT)) & PMC_FRO192M_TC_MASK)
/*! @} */

/*! @name FRO1M - 1 MHz Free Running Oscillator control register */
/*! @{ */

#define PMC_FRO1M_FREQSEL_MASK                   (0x7FU)
#define PMC_FRO1M_FREQSEL_SHIFT                  (0U)
/*! FREQSEL - Frequency trimming bits */
#define PMC_FRO1M_FREQSEL(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FRO1M_FREQSEL_SHIFT)) & PMC_FRO1M_FREQSEL_MASK)

#define PMC_FRO1M_DIVSEL_MASK                    (0x3E00U)
#define PMC_FRO1M_DIVSEL_SHIFT                   (9U)
/*! DIVSEL - Divider selection bits.
 *  0b00000..2.0.
 *  0b00001..4.0.
 *  0b00010..6.0.
 *  0b00011..8.0.
 *  0b00100..10.0.
 *  0b00101..12.0.
 *  0b00110..14.0.
 *  0b00111..16.0.
 *  0b01000..18.0.
 *  0b01001..20.0.
 *  0b01010..22.0.
 *  0b01011..24.0.
 *  0b01100..26.0.
 *  0b01101..28.0.
 *  0b01110..30.0.
 *  0b01111..32.0.
 *  0b10000..34.0.
 *  0b10001..36.0.
 *  0b10010..38.0.
 *  0b10011..40.0.
 *  0b10100..42.0.
 *  0b10101..44.0.
 *  0b10110..46.0.
 *  0b10111..48.0.
 *  0b11000..50.0.
 *  0b11001..52.0.
 *  0b11010..54.0.
 *  0b11011..56.0.
 *  0b11100..58.0.
 *  0b11101..60.0.
 *  0b11110..62.0.
 *  0b11111..1.0.
 */
#define PMC_FRO1M_DIVSEL(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_FRO1M_DIVSEL_SHIFT)) & PMC_FRO1M_DIVSEL_MASK)
/*! @} */

/*! @name FRO32K - 32 KHz Free Running Oscillator (FRO) control register */
/*! @{ */

#define PMC_FRO32K_NTAT_MASK                     (0xEU)
#define PMC_FRO32K_NTAT_SHIFT                    (1U)
/*! NTAT - Temperature coefficient trimming bits. */
#define PMC_FRO32K_NTAT(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FRO32K_NTAT_SHIFT)) & PMC_FRO32K_NTAT_MASK)

#define PMC_FRO32K_PTAT_MASK                     (0x70U)
#define PMC_FRO32K_PTAT_SHIFT                    (4U)
/*! PTAT - Bias trimming bits (coarse frequency trimming). */
#define PMC_FRO32K_PTAT(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_FRO32K_PTAT_SHIFT)) & PMC_FRO32K_PTAT_MASK)

#define PMC_FRO32K_CAPCAL_MASK                   (0xFF80U)
#define PMC_FRO32K_CAPCAL_SHIFT                  (7U)
/*! CAPCAL - Capacitive dac calibration bits (fine frequency trimming). */
#define PMC_FRO32K_CAPCAL(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_FRO32K_CAPCAL_SHIFT)) & PMC_FRO32K_CAPCAL_MASK)
/*! @} */

/*! @name XTAL32K - 32 KHz Crystal oscillator (XTAL) control register */
/*! @{ */

#define PMC_XTAL32K_GM_MASK                      (0x6U)
#define PMC_XTAL32K_GM_SHIFT                     (1U)
/*! GM - Reference output current selection inputs */
#define PMC_XTAL32K_GM(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_XTAL32K_GM_SHIFT)) & PMC_XTAL32K_GM_MASK)

#define PMC_XTAL32K_XTM_MASK                     (0x8U)
#define PMC_XTAL32K_XTM_SHIFT                    (3U)
/*! XTM - Oscillator bypass mode */
#define PMC_XTAL32K_XTM(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_XTAL32K_XTM_SHIFT)) & PMC_XTAL32K_XTM_MASK)

