zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_XTAL32K_AMPL_MASK                    (0xC0U)
#define PMC_XTAL32K_AMPL_SHIFT                   (6U)
/*! AMPL - Oscillator amplitude selection inputs */
#define PMC_XTAL32K_AMPL(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_XTAL32K_AMPL_SHIFT)) & PMC_XTAL32K_AMPL_MASK)

#define PMC_XTAL32K_CAP_OSCIN_MASK               (0xF00U)
#define PMC_XTAL32K_CAP_OSCIN_SHIFT              (8U)
/*! CAP_OSCIN - osc_in capacitorbank selection inputs */
#define PMC_XTAL32K_CAP_OSCIN(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_XTAL32K_CAP_OSCIN_SHIFT)) & PMC_XTAL32K_CAP_OSCIN_MASK)

#define PMC_XTAL32K_CAP_OSCOUT_MASK              (0xF000U)
#define PMC_XTAL32K_CAP_OSCOUT_SHIFT             (12U)
/*! CAP_OSCOUT - osc_out capacitorbank selection inputs */
#define PMC_XTAL32K_CAP_OSCOUT(x)                (((uint32_t)(((uint32_t)(x)) << PMC_XTAL32K_CAP_OSCOUT_SHIFT)) & PMC_XTAL32K_CAP_OSCOUT_MASK)
/*! @} */

/*! @name XTALBLE - BLE XTAL overrule */
/*! @{ */

#define PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK     (0x1U)
#define PMC_XTALBLE_CKO_UNGATE_OVERRULE_SHIFT    (0U)
/*! CKO_UNGATE_OVERRULE - Defines whether the Link Layer HW gets a clock
 *  0b0..The clock going to the Link Layer HW is disabled
 *  0b1..The clock going to the Link Layer HW is enabled
 */
#define PMC_XTALBLE_CKO_UNGATE_OVERRULE(x)       (((uint32_t)(((uint32_t)(x)) << PMC_XTALBLE_CKO_UNGATE_OVERRULE_SHIFT)) & PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK)
/*! @} */

/*! @name WAKEUPIOCTRL - WAKEUPIOCTRL */
/*! @{ */

#define PMC_WAKEUPIOCTRL_ENABLE_MASK             (0x1U)
#define PMC_WAKEUPIOCTRL_ENABLE_SHIFT            (0U)
/*! ENABLE - Enable / disable wake up on Wake Up pin in Deep Power Down modes */
#define PMC_WAKEUPIOCTRL_ENABLE(x)               (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_ENABLE_SHIFT)) & PMC_WAKEUPIOCTRL_ENABLE_MASK)

#define PMC_WAKEUPIOCTRL_PUP_EN_MASK             (0x100U)
#define PMC_WAKEUPIOCTRL_PUP_EN_SHIFT            (8U)
/*! PUP_EN - Enable/disable Wakeup pin Pull-up in PowerOff mode
 *  0b0..Disable pull-up
 *  0b1..Enable pull-up
 */
#define PMC_WAKEUPIOCTRL_PUP_EN(x)               (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_PUP_EN_SHIFT)) & PMC_WAKEUPIOCTRL_PUP_EN_MASK)

#define PMC_WAKEUPIOCTRL_PDN_EN_MASK             (0x200U)
#define PMC_WAKEUPIOCTRL_PDN_EN_SHIFT            (9U)
/*! PDN_EN - Enable/disable Wakeup pin Pull-down in PowerOff mode
 *  0b0..Disable pull-down
 *  0b1..Enable pull-down
 */
#define PMC_WAKEUPIOCTRL_PDN_EN(x)               (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_PDN_EN_SHIFT)) & PMC_WAKEUPIOCTRL_PDN_EN_MASK)

#define PMC_WAKEUPIOCTRL_LVL_MASK                (0x400U)
#define PMC_WAKEUPIOCTRL_LVL_SHIFT               (10U)
/*! LVL - Select Wakeup pin event level in PowerOff
 *  0b0..Wakeup on low level
 *  0b1..Wakeup on high level
 */
#define PMC_WAKEUPIOCTRL_LVL(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_LVL_SHIFT)) & PMC_WAKEUPIOCTRL_LVL_MASK)

#define PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_MASK      (0x200000U)
#define PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_SHIFT     (21U)
/*! WAKEUPIO_RSTN - WAKEUP IO event detector reset control. When this bit is, the RESETCAUSE
 *    register is updated when the wakeup IO causes a wakeup event.
 *  0b0..Bloc is reset.
 *  0b1..Bloc is not reset.
 */
#define PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN(x)        (((uint32_t)(((uint32_t)(x)) << PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_SHIFT)) & PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_MASK)
/*! @} */

/*! @name WAKEIOCAUSE - Allows to identify the Wake-up I/O source from Deep Power Down mode */
/*! @{ */

#define PMC_WAKEIOCAUSE_WAKEUP0_MASK             (0x1U)
#define PMC_WAKEIOCAUSE_WAKEUP0_SHIFT            (0U)
/*! WAKEUP0 - Allows to identify Wake up I/O 0 as the wake-up source from Deep Power Down mode.
 *  0b0..Last wake up from Deep Power down mode was NOT triggred by wake up I/O 0.
 *  0b1..Last wake up from Deep Power down mode was triggred by wake up I/O 0.
 */
#define PMC_WAKEIOCAUSE_WAKEUP0(x)               (((uint32_t)(((uint32_t)(x)) << PMC_WAKEIOCAUSE_WAKEUP0_SHIFT)) & PMC_WAKEIOCAUSE_WAKEUP0_MASK)
/*! @} */

/*! @name STATUSPWR - STATUSPWR */
/*! @{ */

#define PMC_STATUSPWR_DCDCMODE_MASK              (0x3U)
#define PMC_STATUSPWR_DCDCMODE_SHIFT             (0U)
/*! DCDCMODE - DCDC Mode 01: Buck mode 10: Boost mode */
#define PMC_STATUSPWR_DCDCMODE(x)                (((uint32_t)(((uint32_t)(x)) << PMC_STATUSPWR_DCDCMODE_SHIFT)) & PMC_STATUSPWR_DCDCMODE_MASK)

#define PMC_STATUSPWR_DCDCOK_MASK                (0x4U)
#define PMC_STATUSPWR_DCDCOK_SHIFT               (2U)
/*! DCDCOK - DCDC power OK */
#define PMC_STATUSPWR_DCDCOK(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_STATUSPWR_DCDCOK_SHIFT)) & PMC_STATUSPWR_DCDCOK_MASK)

#define PMC_STATUSPWR_LDODIGOK_MASK              (0x8U)
#define PMC_STATUSPWR_LDODIGOK_SHIFT             (3U)
/*! LDODIGOK - LDODIG power OK */
#define PMC_STATUSPWR_LDODIGOK(x)                (((uint32_t)(((uint32_t)(x)) << PMC_STATUSPWR_LDODIGOK_SHIFT)) & PMC_STATUSPWR_LDODIGOK_MASK)

#define PMC_STATUSPWR_LDOMEMOK_MASK              (0x10U)
#define PMC_STATUSPWR_LDOMEMOK_SHIFT             (4U)
/*! LDOMEMOK - LDOMEM power OK */
#define PMC_STATUSPWR_LDOMEMOK(x)                (((uint32_t)(((uint32_t)(x)) << PMC_STATUSPWR_LDOMEMOK_SHIFT)) & PMC_STATUSPWR_LDOMEMOK_MASK)

#define PMC_STATUSPWR_DURATION_MASK              (0x1FFFE0U)
#define PMC_STATUSPWR_DURATION_SHIFT             (5U)
/*! DURATION - DCDC Startup duration in us. */
#define PMC_STATUSPWR_DURATION(x)                (((uint32_t)(((uint32_t)(x)) << PMC_STATUSPWR_DURATION_SHIFT)) & PMC_STATUSPWR_DURATION_MASK)
/*! @} */

/*! @name STATUSCLK - FRO and XTAL status register [Reset by: PoR, Brown Out Detectors Reset] */
/*! @{ */

#define PMC_STATUSCLK_XTAL32KOK_MASK             (0x1U)
#define PMC_STATUSCLK_XTAL32KOK_SHIFT            (0U)
/*! XTAL32KOK - XTAL oscillator 32K OK signal. Note : Bit not working as expected. See artf872570 */
#define PMC_STATUSCLK_XTAL32KOK(x)               (((uint32_t)(((uint32_t)(x)) << PMC_STATUSCLK_XTAL32KOK_SHIFT)) & PMC_STATUSCLK_XTAL32KOK_MASK)

#define PMC_STATUSCLK_FRO1MCLKVALID_MASK         (0x2U)
#define PMC_STATUSCLK_FRO1MCLKVALID_SHIFT        (1U)
/*! FRO1MCLKVALID - FRO 1 MHz CCO voltage detector output */
#define PMC_STATUSCLK_FRO1MCLKVALID(x)           (((uint32_t)(((uint32_t)(x)) << PMC_STATUSCLK_FRO1MCLKVALID_SHIFT)) & PMC_STATUSCLK_FRO1MCLKVALID_MASK)

