zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_TIMEOUTEVENTS_PWUP_FLASHINIT_DONE_MASK (0x8U)
#define PMC_TIMEOUTEVENTS_PWUP_FLASHINIT_DONE_SHIFT (3U)
/*! PWUP_FLASHINIT_DONE - 1: a time out event occured during power up when waiting for Flash initialization. */
#define PMC_TIMEOUTEVENTS_PWUP_FLASHINIT_DONE(x) (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PWUP_FLASHINIT_DONE_SHIFT)) & PMC_TIMEOUTEVENTS_PWUP_FLASHINIT_DONE_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_SRAM_OFF_MASK     (0x10U)
#define PMC_TIMEOUTEVENTS_DSLP_SRAM_OFF_SHIFT    (4U)
/*! DSLP_SRAM_OFF - 1: a time out event occured during deep sleep when waiting for SRAM shut off. */
#define PMC_TIMEOUTEVENTS_DSLP_SRAM_OFF(x)       (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_SRAM_OFF_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_SRAM_OFF_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_DCDC_OK_MASK      (0x20U)
#define PMC_TIMEOUTEVENTS_DSLP_DCDC_OK_SHIFT     (5U)
/*! DSLP_DCDC_OK - 1: a time out event occured during deep sleep when waiting for DCDC to become functional. */
#define PMC_TIMEOUTEVENTS_DSLP_DCDC_OK(x)        (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_DCDC_OK_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_DCDC_OK_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_FLASHINIT_DONE_MASK (0x40U)
#define PMC_TIMEOUTEVENTS_DSLP_FLASHINIT_DONE_SHIFT (6U)
/*! DSLP_FLASHINIT_DONE - 1: a time out event occured during deep sleep when waiting for Flash initialization. */
#define PMC_TIMEOUTEVENTS_DSLP_FLASHINIT_DONE(x) (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_FLASHINIT_DONE_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_FLASHINIT_DONE_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_SRAM_WAKEUP_MASK  (0x80U)
#define PMC_TIMEOUTEVENTS_DSLP_SRAM_WAKEUP_SHIFT (7U)
/*! DSLP_SRAM_WAKEUP - 1: a time out event occured during deep sleep when waiting for SRAM to become functional. */
#define PMC_TIMEOUTEVENTS_DSLP_SRAM_WAKEUP(x)    (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_SRAM_WAKEUP_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_SRAM_WAKEUP_MASK)

#define PMC_TIMEOUTEVENTS_PDWN_SRAM_OFF_MASK     (0x100U)
#define PMC_TIMEOUTEVENTS_PDWN_SRAM_OFF_SHIFT    (8U)
/*! PDWN_SRAM_OFF - 1: a time out event occured during power down when waiting for SRAM shut off. */
#define PMC_TIMEOUTEVENTS_PDWN_SRAM_OFF(x)       (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PDWN_SRAM_OFF_SHIFT)) & PMC_TIMEOUTEVENTS_PDWN_SRAM_OFF_MASK)

#define PMC_TIMEOUTEVENTS_PDWN_DCDC_OK_MASK      (0x200U)
#define PMC_TIMEOUTEVENTS_PDWN_DCDC_OK_SHIFT     (9U)
/*! PDWN_DCDC_OK - 1: a time out event occured during power down when waiting for DCDC to become functional. */
#define PMC_TIMEOUTEVENTS_PDWN_DCDC_OK(x)        (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PDWN_DCDC_OK_SHIFT)) & PMC_TIMEOUTEVENTS_PDWN_DCDC_OK_MASK)

#define PMC_TIMEOUTEVENTS_PDWN_FLASHINIT_DONE_MASK (0x1000U)
#define PMC_TIMEOUTEVENTS_PDWN_FLASHINIT_DONE_SHIFT (12U)
/*! PDWN_FLASHINIT_DONE - 1: a time out event occured during power down when waiting for flash initialization to become functional. */
#define PMC_TIMEOUTEVENTS_PDWN_FLASHINIT_DONE(x) (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PDWN_FLASHINIT_DONE_SHIFT)) & PMC_TIMEOUTEVENTS_PDWN_FLASHINIT_DONE_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_BLE_SHUTDOWN_MASK (0x2000U)
#define PMC_TIMEOUTEVENTS_DSLP_BLE_SHUTDOWN_SHIFT (13U)
/*! DSLP_BLE_SHUTDOWN - 1: a time out event occured during deep sleep when waiting for BLE powerdown ack. */
#define PMC_TIMEOUTEVENTS_DSLP_BLE_SHUTDOWN(x)   (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_BLE_SHUTDOWN_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_BLE_SHUTDOWN_MASK)

#define PMC_TIMEOUTEVENTS_PDWN_BLE_SHUTDOWN_MASK (0x4000U)
#define PMC_TIMEOUTEVENTS_PDWN_BLE_SHUTDOWN_SHIFT (14U)
/*! PDWN_BLE_SHUTDOWN - 1: a time out event occured during power down when waiting for BLE powerdown ack. */
#define PMC_TIMEOUTEVENTS_PDWN_BLE_SHUTDOWN(x)   (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PDWN_BLE_SHUTDOWN_SHIFT)) & PMC_TIMEOUTEVENTS_PDWN_BLE_SHUTDOWN_MASK)

#define PMC_TIMEOUTEVENTS_PWUP_CLK192MHZ_OK_MASK (0x8000U)
#define PMC_TIMEOUTEVENTS_PWUP_CLK192MHZ_OK_SHIFT (15U)
/*! PWUP_CLK192MHZ_OK - 1: a time out event occured during power up when waiting for oscillator startup. */
#define PMC_TIMEOUTEVENTS_PWUP_CLK192MHZ_OK(x)   (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PWUP_CLK192MHZ_OK_SHIFT)) & PMC_TIMEOUTEVENTS_PWUP_CLK192MHZ_OK_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_CLK192MHZ_OK_MASK (0x10000U)
#define PMC_TIMEOUTEVENTS_DSLP_CLK192MHZ_OK_SHIFT (16U)
/*! DSLP_CLK192MHZ_OK - 1: a time out event occured during power up from low power state when waiting for oscillator startup. */
#define PMC_TIMEOUTEVENTS_DSLP_CLK192MHZ_OK(x)   (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_CLK192MHZ_OK_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_CLK192MHZ_OK_MASK)

#define PMC_TIMEOUTEVENTS_PWDN_CLK192MHZ_OK_MASK (0x20000U)
#define PMC_TIMEOUTEVENTS_PWDN_CLK192MHZ_OK_SHIFT (17U)
/*! PWDN_CLK192MHZ_OK - 1: a time out event occured during power up from power down state when waiting for oscillator startup. */
#define PMC_TIMEOUTEVENTS_PWDN_CLK192MHZ_OK(x)   (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PWDN_CLK192MHZ_OK_SHIFT)) & PMC_TIMEOUTEVENTS_PWDN_CLK192MHZ_OK_MASK)

#define PMC_TIMEOUTEVENTS_PWUP_BLE_STARTUP_MASK  (0x40000U)
#define PMC_TIMEOUTEVENTS_PWUP_BLE_STARTUP_SHIFT (18U)
/*! PWUP_BLE_STARTUP - 1: a time out event occured during power up when waiting for BLE. */
#define PMC_TIMEOUTEVENTS_PWUP_BLE_STARTUP(x)    (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PWUP_BLE_STARTUP_SHIFT)) & PMC_TIMEOUTEVENTS_PWUP_BLE_STARTUP_MASK)

#define PMC_TIMEOUTEVENTS_DSLP_BLE_STARTUP_MASK  (0x80000U)
#define PMC_TIMEOUTEVENTS_DSLP_BLE_STARTUP_SHIFT (19U)
/*! DSLP_BLE_STARTUP - 1: a time out event occured during power up from deepsleep state when waiting for BLE. */
#define PMC_TIMEOUTEVENTS_DSLP_BLE_STARTUP(x)    (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_DSLP_BLE_STARTUP_SHIFT)) & PMC_TIMEOUTEVENTS_DSLP_BLE_STARTUP_MASK)

#define PMC_TIMEOUTEVENTS_PWDN_BLE_STARTUP_MASK  (0x100000U)
#define PMC_TIMEOUTEVENTS_PWDN_BLE_STARTUP_SHIFT (20U)
/*! PWDN_BLE_STARTUP - 1: a time out event occured during power up from power down state when waiting for BLE. */
#define PMC_TIMEOUTEVENTS_PWDN_BLE_STARTUP(x)    (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUTEVENTS_PWDN_BLE_STARTUP_SHIFT)) & PMC_TIMEOUTEVENTS_PWDN_BLE_STARTUP_MASK)
/*! @} */

/*! @name TIMEOUT - TIMEOUT */
/*! @{ */

#define PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_MASK (0xF0000U)
#define PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_SHIFT (16U)
/*! BLE_RESTART_OSCEN_TIME_OUT - Time out value for BLE restart. Resolution is 32 us. Default is 160us */
#define PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT(x) (((uint32_t)(((uint32_t)(x)) << PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_SHIFT)) & PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_MASK)
/*! @} */

/*! @name PDSLEEPCFG0 - Controls the power to various modules during Low Power modes - DEEP SLEEP, POWER DOWN and DEEP POWER DOWN [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset] */
/*! @{ */

#define PMC_PDSLEEPCFG0_PDEN_DCDC_MASK           (0x1U)
#define PMC_PDSLEEPCFG0_PDEN_DCDC_SHIFT          (0U)
/*! PDEN_DCDC - Controls DCDC power during low power mode (DCDC is always shut down during POWEROFF).
 *  0b0..DCDC is powered on during low power mode..
 *  0b1..DCDC is powered off during low power mode..
 */
#define PMC_PDSLEEPCFG0_PDEN_DCDC(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_DCDC_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_DCDC_MASK)

#define PMC_PDSLEEPCFG0_PDEN_BIAS_MASK           (0x6U)
#define PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT          (1U)
/*! PDEN_BIAS - Enable or disable bandgap in high or low power mode.
 *  0b00..Bias 0.66V low power mode enabled. This is intended to be used for retention mode of memory or digital
 *  0b01..Bias 0.63V high accuracy mode enabled. During active mode, the bias must be set in high accuracy mode
 *  0b1x..Bias disabled.
 */
#define PMC_PDSLEEPCFG0_PDEN_BIAS(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_BIAS_MASK)

