zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_PDSLEEPCFG0_PDEN_BOD1_MASK           (0x8U)
#define PMC_PDSLEEPCFG0_PDEN_BOD1_SHIFT          (3U)
/*! PDEN_BOD1 - Controls BoD 1 power during low power mode. (BOD1 is always shut down during POWEROFF)
 *  0b0..BOD1 is powered on during low power mode.
 *  0b1..BOD1 is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_BOD1(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_BOD1_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_BOD1_MASK)

#define PMC_PDSLEEPCFG0_PDEN_BOD2_MASK           (0x10U)
#define PMC_PDSLEEPCFG0_PDEN_BOD2_SHIFT          (4U)
/*! PDEN_BOD2 - Controls BoD 2 power during low power mode. (BOD2 is always shut down during POWEROFF)
 *  0b0..BOD2 is powered on during low power mode.
 *  0b1..BOD2 is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_BOD2(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_BOD2_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_BOD2_MASK)

#define PMC_PDSLEEPCFG0_PDEN_FRO192M_MASK        (0x20U)
#define PMC_PDSLEEPCFG0_PDEN_FRO192M_SHIFT       (5U)
/*! PDEN_FRO192M - Controls 192MHz Free Running Oscillator power during DEEP SLEEP (always shut down
 *    during POWER DOWN, DEEP POWER DOWN and POWEROFF).
 *  0b0..FRO 192 MHz is powered on during low power mode.
 *  0b1..FRO 192 MHz is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_FRO192M(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_FRO192M_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_FRO192M_MASK)

#define PMC_PDSLEEPCFG0_PDEN_FRO32K_MASK         (0x40U)
#define PMC_PDSLEEPCFG0_PDEN_FRO32K_SHIFT        (6U)
/*! PDEN_FRO32K - Controls power during DEEP SLEEP, POWER DOWN and DEEP POWER DOWN. (FRO32K is always shut down during POWEROFF)
 *  0b0..FRO 32 KHz is powered on during low power mode.
 *  0b1..FRO 32 KHz is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_FRO32K(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_FRO32K_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_FRO32K_MASK)

#define PMC_PDSLEEPCFG0_PDEN_XTAL32K_MASK        (0x80U)
#define PMC_PDSLEEPCFG0_PDEN_XTAL32K_SHIFT       (7U)
/*! PDEN_XTAL32K - Controls crystal 32 KHz power during DEEP SLEEP, POWER DOWN and DEEP POWER DOWN.
 *    (XTAL32K is always shut down during POWEROFF)
 *  0b0..crystal 32 KHz is powered on during low power mode.
 *  0b1..crystal 32 KHz is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_XTAL32K(x)          (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_XTAL32K_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_XTAL32K_MASK)

#define PMC_PDSLEEPCFG0_PDEN_FRO1M_MASK          (0x100U)
#define PMC_PDSLEEPCFG0_PDEN_FRO1M_SHIFT         (8U)
/*! PDEN_FRO1M - Controls power during DEEP SLEEP and POWER DOWN . (FRO1M is always shut down during DEEP POWER DOWN and POWEROFF)
 *  0b0..FRO 1 MHz is powered on during low power mode.
 *  0b1..FRO 1 MHz is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_FRO1M(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_FRO1M_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_FRO1M_MASK)

#define PMC_PDSLEEPCFG0_PDEN_BLE_MASK            (0x400U)
#define PMC_PDSLEEPCFG0_PDEN_BLE_SHIFT           (10U)
/*! PDEN_BLE - Enable power down of BLE retention domain in low power mode
 *  0b0..BLE retention domain is powered on during low power mode.
 *  0b1..BLE retention domain is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_BLE(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_BLE_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_BLE_MASK)

#define PMC_PDSLEEPCFG0_PDEN_CORE_MASK           (0x2000U)
#define PMC_PDSLEEPCFG0_PDEN_CORE_SHIFT          (13U)
/*! PDEN_CORE - Enable power down of core domain in deepsleep
 *  0b0..Digital core power domain is powered on during deep sleep mode.
 *  0b1..Digital core power domain is powered off during deep sleep mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_CORE(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_CORE_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_CORE_MASK)

#define PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK         (0x10000U)
#define PMC_PDSLEEPCFG0_PDEN_LDOMEM_SHIFT        (16U)
/*! PDEN_LDOMEM - Enable power down of LDO MEM power domain in low power mode
 *  0b0..LDO MEM power domain is powered on during low power mode.
 *  0b1..LDO MEM power domain is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_LDOMEM(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_LDOMEM_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK)

#define PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK         (0x20000U)
#define PMC_PDSLEEPCFG0_PDEN_LDODIG_SHIFT        (17U)
/*! PDEN_LDODIG - Enable power down of LDO_DIG in low power mode
 *  0b0..LDO DIG power domain is powered on during low power mode.
 *  0b1..LDO DIG power domain is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_LDODIG(x)           (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_LDODIG_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK)

#define PMC_PDSLEEPCFG0_PDEN_BLE_XO32M_MASK      (0x100000U)
#define PMC_PDSLEEPCFG0_PDEN_BLE_XO32M_SHIFT     (20U)
/*! PDEN_BLE_XO32M - Enable power down of BLE 32MHz XO in low power mode
 *  0b0..32MHz crystal oscillator is powered on during low power mode.
 *  0b1..32MHz crystal oscillator is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_BLE_XO32M(x)        (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_BLE_XO32M_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_BLE_XO32M_MASK)

#define PMC_PDSLEEPCFG0_PDEN_RNG_MASK            (0x400000U)
#define PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT           (22U)
/*! PDEN_RNG - Enable power down of RNG block in low power mode
 *  0b0..RNG module is powered on during low power mode.
 *  0b1..RNG module is powered off during low power mode.
 */
#define PMC_PDSLEEPCFG0_PDEN_RNG(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDSLEEPCFG0_PDEN_RNG_SHIFT)) & PMC_PDSLEEPCFG0_PDEN_RNG_MASK)
/*! @} */

/*! @name SRAMRETCTRL - SRAMRETCTRL */
/*! @{ */

#define PMC_SRAMRETCTRL_RETEN_RAMX0_MASK         (0x1U)
#define PMC_SRAMRETCTRL_RETEN_RAMX0_SHIFT        (0U)
/*! RETEN_RAMX0 - Controls RAMX0 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMX0(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMX0_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMX0_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAMX1_MASK         (0x2U)
#define PMC_SRAMRETCTRL_RETEN_RAMX1_SHIFT        (1U)
/*! RETEN_RAMX1 - Controls RAMX1 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMX1(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMX1_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMX1_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAMX2_MASK         (0x4U)
#define PMC_SRAMRETCTRL_RETEN_RAMX2_SHIFT        (2U)
/*! RETEN_RAMX2 - Controls RAMX2 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMX2(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMX2_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMX2_MASK)

