zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_SRAMRETCTRL_RETEN_RAMX3_MASK         (0x8U)
#define PMC_SRAMRETCTRL_RETEN_RAMX3_SHIFT        (3U)
/*! RETEN_RAMX3 - Controls RAMX3 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMX3(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMX3_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMX3_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM00_MASK         (0x10U)
#define PMC_SRAMRETCTRL_RETEN_RAM00_SHIFT        (4U)
/*! RETEN_RAM00 - Controls RAM00 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAM00(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM00_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM00_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM10_MASK         (0x20U)
#define PMC_SRAMRETCTRL_RETEN_RAM10_SHIFT        (5U)
/*! RETEN_RAM10 - Controls RAM10 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAM10(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM10_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM10_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAM20_MASK         (0x40U)
#define PMC_SRAMRETCTRL_RETEN_RAM20_SHIFT        (6U)
/*! RETEN_RAM20 - Controls RAM20 power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAM20(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAM20_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAM20_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_MASK    (0x80U)
#define PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_SHIFT   (7U)
/*! RETEN_RAMBLEDATA - Controls BLE Data RAM power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMBLEDATA(x)      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_MASK)

#define PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_MASK    (0x100U)
#define PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_SHIFT   (8U)
/*! RETEN_RAMBLESEQL - Controls BLE Sequencer/List RAM power down modes during low power modes.
 *  0b0..DEEP SLEEP: the SRAM instance keeps the configuration it has before entering DEEP SLEEP, what ever it is
 *       (Normal, Light Sleep, Deep-Sleep mode and Shut down modes) POWER DOWN, DEEP POWER DOWN and POWEREDOFF: the
 *       SRAM instance is in 'Shutdown mode' (In this mode there is no data retention).
 *  0b1..The SRAM will go to DEEPSLEEP mode during DEEPSLEEP and POWERDOWN state (In this mode there is data
 *       retention), except when it was already in SHUTDOWN state during ACTIVE mode. If it was already in SHUTDOWN
 *       during ACTIVE mode, the SRAM will remain in SHUTDOWN.
 */
#define PMC_SRAMRETCTRL_RETEN_RAMBLESEQL(x)      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_SHIFT)) & PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_MASK)
/*! @} */

/*! @name PDRUNCFG0 - PDRUNCFG0 */
/*! @{ */

#define PMC_PDRUNCFG0_PDEN_DCDC_MASK             (0x1U)
#define PMC_PDRUNCFG0_PDEN_DCDC_SHIFT            (0U)
/*! PDEN_DCDC - Controls power to DCDC Converter.
 *  0b0..DCDC is powered
 *  0b1..DCDC is powered down
 */
#define PMC_PDRUNCFG0_PDEN_DCDC(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_DCDC_SHIFT)) & PMC_PDRUNCFG0_PDEN_DCDC_MASK)

#define PMC_PDRUNCFG0_PDEN_BIAS_MASK             (0x6U)
#define PMC_PDRUNCFG0_PDEN_BIAS_SHIFT            (1U)
/*! PDEN_BIAS - Enable or disable bandgap in high or low power mode.
 *  0b00..Bias 0.66V low power mode enabled. This is intended to be used for retention mode of memory or digital
 *  0b01..Bias 0.63V high accuracy mode enabled. During active mode, the bias must be set in high accuracy mode
 *  0b1x..Bias disabled.
 */
#define PMC_PDRUNCFG0_PDEN_BIAS(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_BIAS_SHIFT)) & PMC_PDRUNCFG0_PDEN_BIAS_MASK)

#define PMC_PDRUNCFG0_PDEN_BOD1_MASK             (0x8U)
#define PMC_PDRUNCFG0_PDEN_BOD1_SHIFT            (3U)
/*! PDEN_BOD1 - Controls power to Brown Out Detector 1 (BOD1)
 *  0b0..BOD1 is powered
 *  0b1..BOD1 is powered down
 */
#define PMC_PDRUNCFG0_PDEN_BOD1(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_BOD1_SHIFT)) & PMC_PDRUNCFG0_PDEN_BOD1_MASK)

