zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_PDRUNCFG0_PDEN_BOD2_MASK             (0x10U)
#define PMC_PDRUNCFG0_PDEN_BOD2_SHIFT            (4U)
/*! PDEN_BOD2 - Controls power to Brown Out Detector 2 (BOD2)
 *  0b0..BOD2 is powered
 *  0b1..BOD2 is powered down
 */
#define PMC_PDRUNCFG0_PDEN_BOD2(x)               (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_BOD2_SHIFT)) & PMC_PDRUNCFG0_PDEN_BOD2_MASK)

#define PMC_PDRUNCFG0_PDEN_FRO192M_MASK          (0x20U)
#define PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT         (5U)
/*! PDEN_FRO192M - Controls power to 192MHz Free Running Oscillator
 *  0b0..FRO 192 MHz is powered
 *  0b1..FRO 192 MHz is powered down
 */
#define PMC_PDRUNCFG0_PDEN_FRO192M(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT)) & PMC_PDRUNCFG0_PDEN_FRO192M_MASK)

#define PMC_PDRUNCFG0_PDEN_FRO32K_MASK           (0x40U)
#define PMC_PDRUNCFG0_PDEN_FRO32K_SHIFT          (6U)
/*! PDEN_FRO32K - Controls power to FRO 32 KHz
 *  0b0..FRO 32 KHz is powered
 *  0b1..FRO 32 KHz is powered down
 */
#define PMC_PDRUNCFG0_PDEN_FRO32K(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_FRO32K_SHIFT)) & PMC_PDRUNCFG0_PDEN_FRO32K_MASK)

#define PMC_PDRUNCFG0_PDEN_XTAL32K_MASK          (0x80U)
#define PMC_PDRUNCFG0_PDEN_XTAL32K_SHIFT         (7U)
/*! PDEN_XTAL32K - Controls power to crystal 32 KHz
 *  0b0..crystal 32 KHz is powered
 *  0b1..crystal 32 KHz is powered down
 */
#define PMC_PDRUNCFG0_PDEN_XTAL32K(x)            (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_XTAL32K_SHIFT)) & PMC_PDRUNCFG0_PDEN_XTAL32K_MASK)

#define PMC_PDRUNCFG0_PDEN_FRO1M_MASK            (0x100U)
#define PMC_PDRUNCFG0_PDEN_FRO1M_SHIFT           (8U)
/*! PDEN_FRO1M - Controls power to FRO 1 MHz
 *  0b0..FRO 1 MHz is powered
 *  0b1..FRO 1 MHz is powered down
 */
#define PMC_PDRUNCFG0_PDEN_FRO1M(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_FRO1M_SHIFT)) & PMC_PDRUNCFG0_PDEN_FRO1M_MASK)

#define PMC_PDRUNCFG0_PDEN_BLE_MASK              (0x400U)
#define PMC_PDRUNCFG0_PDEN_BLE_SHIFT             (10U)
/*! PDEN_BLE - Control power to BLE
 *  0b0..BLE retention domain is powered
 *  0b1..BLE retention domain is powered down
 */
#define PMC_PDRUNCFG0_PDEN_BLE(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_BLE_SHIFT)) & PMC_PDRUNCFG0_PDEN_BLE_MASK)

#define PMC_PDRUNCFG0_PDEN_LDOMEM_MASK           (0x10000U)
#define PMC_PDRUNCFG0_PDEN_LDOMEM_SHIFT          (16U)
/*! PDEN_LDOMEM - Control power to LDO MEM power domain
 *  0b0..LDO MEM power domain is powered
 *  0b1..LDO MEM power domain is powered down
 */
#define PMC_PDRUNCFG0_PDEN_LDOMEM(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_LDOMEM_SHIFT)) & PMC_PDRUNCFG0_PDEN_LDOMEM_MASK)

#define PMC_PDRUNCFG0_PDEN_LDODIG_MASK           (0x20000U)
#define PMC_PDRUNCFG0_PDEN_LDODIG_SHIFT          (17U)
/*! PDEN_LDODIG - Control power to LDO_DIG power domain
 *  0b0..LDO DIG power domain is powered
 *  0b1..LDO DIG power domain is powered down
 */
#define PMC_PDRUNCFG0_PDEN_LDODIG(x)             (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_LDODIG_SHIFT)) & PMC_PDRUNCFG0_PDEN_LDODIG_MASK)

#define PMC_PDRUNCFG0_PDEN_FLASH_MASK            (0x200000U)
#define PMC_PDRUNCFG0_PDEN_FLASH_SHIFT           (21U)
/*! PDEN_FLASH - Control power to Flash block
 *  0b0..Flash module is powered
 *  0b1..Flash module is powered down
 */
#define PMC_PDRUNCFG0_PDEN_FLASH(x)              (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_FLASH_SHIFT)) & PMC_PDRUNCFG0_PDEN_FLASH_MASK)

#define PMC_PDRUNCFG0_PDEN_RNG_MASK              (0x400000U)
#define PMC_PDRUNCFG0_PDEN_RNG_SHIFT             (22U)
/*! PDEN_RNG - Control power to RNG block
 *  0b0..RNG module is powered
 *  0b1..RNG module is powered down
 */
#define PMC_PDRUNCFG0_PDEN_RNG(x)                (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFG0_PDEN_RNG_SHIFT)) & PMC_PDRUNCFG0_PDEN_RNG_MASK)
/*! @} */

/*! @name PDRUNCFGSET0 - Controls the power to various analog blocks [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] */
/*! @{ */

#define PMC_PDRUNCFGSET0_PDRUNCFGSET0_MASK       (0xFFFFFFFFU)
#define PMC_PDRUNCFGSET0_PDRUNCFGSET0_SHIFT      (0U)
/*! PDRUNCFGSET0 - Writing ones to this register sets the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented. */
#define PMC_PDRUNCFGSET0_PDRUNCFGSET0(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGSET0_PDRUNCFGSET0_SHIFT)) & PMC_PDRUNCFGSET0_PDRUNCFGSET0_MASK)
/*! @} */

/*! @name PDRUNCFGCLR0 - Controls the power to various analog blocks [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] */
/*! @{ */

#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_MASK       (0xFFFFFFFFU)
#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_SHIFT      (0U)
/*! PDRUNCFGCLR0 - Writing ones to this register clears the corresponding bit or bits in the PDRUNCFG0 register, if they are implemented. */
#define PMC_PDRUNCFGCLR0_PDRUNCFGCLR0(x)         (((uint32_t)(((uint32_t)(x)) << PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_SHIFT)) & PMC_PDRUNCFGCLR0_PDRUNCFGCLR0_MASK)
/*! @} */

/*! @name ROMCTRL - ROM control [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] */
/*! @{ */

#define PMC_ROMCTRL_SDB_MASK                     (0x1U)
#define PMC_ROMCTRL_SDB_SHIFT                    (0U)
/*! SDB - Shutdown pin (active low). This bit is only used during DfT. */
#define PMC_ROMCTRL_SDB(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_ROMCTRL_SDB_SHIFT)) & PMC_ROMCTRL_SDB_MASK)

#define PMC_ROMCTRL_LS_MASK                      (0x2U)
#define PMC_ROMCTRL_LS_SHIFT                     (1U)
/*! LS - Light sleep (active high). This bit is only used during DfT. */
#define PMC_ROMCTRL_LS(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_ROMCTRL_LS_SHIFT)) & PMC_ROMCTRL_LS_MASK)

#define PMC_ROMCTRL_RME_MASK                     (0x4U)
#define PMC_ROMCTRL_RME_SHIFT                    (2U)
/*! RME - Read Margin Enable */
#define PMC_ROMCTRL_RME(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_ROMCTRL_RME_SHIFT)) & PMC_ROMCTRL_RME_MASK)

#define PMC_ROMCTRL_RM_MASK                      (0x78U)
#define PMC_ROMCTRL_RM_SHIFT                     (3U)
/*! RM - read margin control setting */
#define PMC_ROMCTRL_RM(x)                        (((uint32_t)(((uint32_t)(x)) << PMC_ROMCTRL_RM_SHIFT)) & PMC_ROMCTRL_RM_MASK)
/*! @} */

/*! @name SRAMCTRL - All SRAMs common control signals [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Software Reset] */
/*! @{ */

#define PMC_SRAMCTRL_SMB_MASK                    (0x7U)
#define PMC_SRAMCTRL_SMB_SHIFT                   (0U)
/*! SMB - Source Biasing voltage.
 *  0b000..Low leakage.
 *  0b001..Medium leakage.
 *  0b010..Highest leakage.
 *  0b011..Disable.
 */
#define PMC_SRAMCTRL_SMB(x)                      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL_SMB_SHIFT)) & PMC_SRAMCTRL_SMB_MASK)

#define PMC_SRAMCTRL_RM_MASK                     (0xF8U)
#define PMC_SRAMCTRL_RM_SHIFT                    (3U)
/*! RM - Read Margin control settings */
#define PMC_SRAMCTRL_RM(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL_RM_SHIFT)) & PMC_SRAMCTRL_RM_MASK)

