zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_SRAMCTRL_WM_MASK                     (0x700U)
#define PMC_SRAMCTRL_WM_SHIFT                    (8U)
/*! WM - Write Margin control settings */
#define PMC_SRAMCTRL_WM(x)                       (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL_WM_SHIFT)) & PMC_SRAMCTRL_WM_MASK)
/*! @} */

/*! @name SRAMCTRL0 - RAMX0 to RAM20 power modes controls [Reset by: PoR, Pin Reset, Brown Out Detectors Reset, Deep Power Down Reset, Software Reset] When [LS, LSDEL, DSB, DSBDEL] is: 0011 : Normal Mode 1111 : Light sleep mode 0100 : Deep-sleep mode 1100 : Shut down Mode */
/*! @{ */

#define PMC_SRAMCTRL0_RAMX0_LS_MASK              (0x1U)
#define PMC_SRAMCTRL0_RAMX0_LS_SHIFT             (0U)
/*! RAMX0_LS - RAMX0 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAMX0_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX0_LS_SHIFT)) & PMC_SRAMCTRL0_RAMX0_LS_MASK)

#define PMC_SRAMCTRL0_RAMX0_DSB_MASK             (0x2U)
#define PMC_SRAMCTRL0_RAMX0_DSB_SHIFT            (1U)
/*! RAMX0_DSB - RAMX0 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAMX0_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX0_DSB_SHIFT)) & PMC_SRAMCTRL0_RAMX0_DSB_MASK)

#define PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK          (0x4U)
#define PMC_SRAMCTRL0_RAMX0_DSBDEL_SHIFT         (2U)
/*! RAMX0_DSBDEL - RAMX0 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAMX0_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX0_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAMX0_LSDEL_MASK           (0x8U)
#define PMC_SRAMCTRL0_RAMX0_LSDEL_SHIFT          (3U)
/*! RAMX0_LSDEL - RAMX0 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAMX0_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX0_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX0_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAMX1_LS_MASK              (0x10U)
#define PMC_SRAMCTRL0_RAMX1_LS_SHIFT             (4U)
/*! RAMX1_LS - RAMX1 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAMX1_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX1_LS_SHIFT)) & PMC_SRAMCTRL0_RAMX1_LS_MASK)

#define PMC_SRAMCTRL0_RAMX1_DSB_MASK             (0x20U)
#define PMC_SRAMCTRL0_RAMX1_DSB_SHIFT            (5U)
/*! RAMX1_DSB - RAMX1 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAMX1_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX1_DSB_SHIFT)) & PMC_SRAMCTRL0_RAMX1_DSB_MASK)

#define PMC_SRAMCTRL0_RAMX1_DSBDEL_MASK          (0x40U)
#define PMC_SRAMCTRL0_RAMX1_DSBDEL_SHIFT         (6U)
/*! RAMX1_DSBDEL - RAMX1 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAMX1_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX1_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX1_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAMX1_LSDEL_MASK           (0x80U)
#define PMC_SRAMCTRL0_RAMX1_LSDEL_SHIFT          (7U)
/*! RAMX1_LSDEL - RAMX1 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAMX1_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX1_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX1_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAMX2_LS_MASK              (0x100U)
#define PMC_SRAMCTRL0_RAMX2_LS_SHIFT             (8U)
/*! RAMX2_LS - RAMX2 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAMX2_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX2_LS_SHIFT)) & PMC_SRAMCTRL0_RAMX2_LS_MASK)

#define PMC_SRAMCTRL0_RAMX2_DSB_MASK             (0x200U)
#define PMC_SRAMCTRL0_RAMX2_DSB_SHIFT            (9U)
/*! RAMX2_DSB - RAMX2 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAMX2_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX2_DSB_SHIFT)) & PMC_SRAMCTRL0_RAMX2_DSB_MASK)

#define PMC_SRAMCTRL0_RAMX2_DSBDEL_MASK          (0x400U)
#define PMC_SRAMCTRL0_RAMX2_DSBDEL_SHIFT         (10U)
/*! RAMX2_DSBDEL - RAMX2 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAMX2_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX2_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX2_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAMX2_LSDEL_MASK           (0x800U)
#define PMC_SRAMCTRL0_RAMX2_LSDEL_SHIFT          (11U)
/*! RAMX2_LSDEL - RAMX2 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAMX2_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX2_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX2_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAMX3_LS_MASK              (0x1000U)
#define PMC_SRAMCTRL0_RAMX3_LS_SHIFT             (12U)
/*! RAMX3_LS - RAMX3 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAMX3_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX3_LS_SHIFT)) & PMC_SRAMCTRL0_RAMX3_LS_MASK)

#define PMC_SRAMCTRL0_RAMX3_DSB_MASK             (0x2000U)
#define PMC_SRAMCTRL0_RAMX3_DSB_SHIFT            (13U)
/*! RAMX3_DSB - RAMX3 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAMX3_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX3_DSB_SHIFT)) & PMC_SRAMCTRL0_RAMX3_DSB_MASK)

#define PMC_SRAMCTRL0_RAMX3_DSBDEL_MASK          (0x4000U)
#define PMC_SRAMCTRL0_RAMX3_DSBDEL_SHIFT         (14U)
/*! RAMX3_DSBDEL - RAMX3 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAMX3_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX3_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX3_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAMX3_LSDEL_MASK           (0x8000U)
#define PMC_SRAMCTRL0_RAMX3_LSDEL_SHIFT          (15U)
/*! RAMX3_LSDEL - RAMX3 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAMX3_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAMX3_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAMX3_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM00_LS_MASK              (0x10000U)
#define PMC_SRAMCTRL0_RAM00_LS_SHIFT             (16U)
/*! RAM00_LS - RAM00 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAM00_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM00_LS_SHIFT)) & PMC_SRAMCTRL0_RAM00_LS_MASK)

#define PMC_SRAMCTRL0_RAM00_DSB_MASK             (0x20000U)
#define PMC_SRAMCTRL0_RAM00_DSB_SHIFT            (17U)
/*! RAM00_DSB - RAM00 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAM00_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM00_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM00_DSB_MASK)

#define PMC_SRAMCTRL0_RAM00_DSBDEL_MASK          (0x40000U)
#define PMC_SRAMCTRL0_RAM00_DSBDEL_SHIFT         (18U)
/*! RAM00_DSBDEL - RAM00 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAM00_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM00_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM00_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM00_LSDEL_MASK           (0x80000U)
#define PMC_SRAMCTRL0_RAM00_LSDEL_SHIFT          (19U)
/*! RAM00_LSDEL - RAM00 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAM00_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM00_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM00_LSDEL_MASK)

#define PMC_SRAMCTRL0_RAM10_LS_MASK              (0x100000U)
#define PMC_SRAMCTRL0_RAM10_LS_SHIFT             (20U)
/*! RAM10_LS - RAM10 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAM10_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM10_LS_SHIFT)) & PMC_SRAMCTRL0_RAM10_LS_MASK)

#define PMC_SRAMCTRL0_RAM10_DSB_MASK             (0x200000U)
#define PMC_SRAMCTRL0_RAM10_DSB_SHIFT            (21U)
/*! RAM10_DSB - RAM10 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAM10_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM10_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM10_DSB_MASK)

#define PMC_SRAMCTRL0_RAM10_DSBDEL_MASK          (0x400000U)
#define PMC_SRAMCTRL0_RAM10_DSBDEL_SHIFT         (22U)
/*! RAM10_DSBDEL - RAM10 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAM10_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM10_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM10_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM10_LSDEL_MASK           (0x800000U)
#define PMC_SRAMCTRL0_RAM10_LSDEL_SHIFT          (23U)
/*! RAM10_LSDEL - RAM10 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAM10_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM10_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM10_LSDEL_MASK)

