zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_SRAMCTRL0_RAM20_LS_MASK              (0x1000000U)
#define PMC_SRAMCTRL0_RAM20_LS_SHIFT             (24U)
/*! RAM20_LS - RAM20 Light Sleep mode. */
#define PMC_SRAMCTRL0_RAM20_LS(x)                (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM20_LS_SHIFT)) & PMC_SRAMCTRL0_RAM20_LS_MASK)

#define PMC_SRAMCTRL0_RAM20_DSB_MASK             (0x2000000U)
#define PMC_SRAMCTRL0_RAM20_DSB_SHIFT            (25U)
/*! RAM20_DSB - RAM20 Deep sleep mode. */
#define PMC_SRAMCTRL0_RAM20_DSB(x)               (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM20_DSB_SHIFT)) & PMC_SRAMCTRL0_RAM20_DSB_MASK)

#define PMC_SRAMCTRL0_RAM20_DSBDEL_MASK          (0x4000000U)
#define PMC_SRAMCTRL0_RAM20_DSBDEL_SHIFT         (26U)
/*! RAM20_DSBDEL - RAM20 Deep sleep delayed. */
#define PMC_SRAMCTRL0_RAM20_DSBDEL(x)            (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM20_DSBDEL_SHIFT)) & PMC_SRAMCTRL0_RAM20_DSBDEL_MASK)

#define PMC_SRAMCTRL0_RAM20_LSDEL_MASK           (0x8000000U)
#define PMC_SRAMCTRL0_RAM20_LSDEL_SHIFT          (27U)
/*! RAM20_LSDEL - RAM20 Sleep mode disable. */
#define PMC_SRAMCTRL0_RAM20_LSDEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL0_RAM20_LSDEL_SHIFT)) & PMC_SRAMCTRL0_RAM20_LSDEL_MASK)
/*! @} */

/*! @name SRAMCTRL1 - BLE RAM power mode controls */
/*! @{ */

#define PMC_SRAMCTRL1_RAMBLEDATA_LS_MASK         (0x1U)
#define PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT        (0U)
/*! RAMBLEDATA_LS - RAM BLE Data Light Sleep mode */
#define PMC_SRAMCTRL1_RAMBLEDATA_LS(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT)) & PMC_SRAMCTRL1_RAMBLEDATA_LS_MASK)

#define PMC_SRAMCTRL1_RAMBLEDATA_DSB_MASK        (0x2U)
#define PMC_SRAMCTRL1_RAMBLEDATA_DSB_SHIFT       (1U)
/*! RAMBLEDATA_DSB - RAM BLE Data Deep sleep mode */
#define PMC_SRAMCTRL1_RAMBLEDATA_DSB(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLEDATA_DSB_SHIFT)) & PMC_SRAMCTRL1_RAMBLEDATA_DSB_MASK)

#define PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_MASK     (0x4U)
#define PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_SHIFT    (2U)
/*! RAMBLEDATA_DSBDEL - RAM BLE Data Deep sleep delayed */
#define PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL(x)       (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_MASK      (0x8U)
#define PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_SHIFT     (3U)
/*! RAMBLEDATA_LSDEL - RAM BLE Data Sleep mode disable */
#define PMC_SRAMCTRL1_RAMBLEDATA_LSDEL(x)        (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAMBLESEQL_LS_MASK         (0x10U)
#define PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT        (4U)
/*! RAMBLESEQL_LS - RAM BLE Sequencer Light Sleep mode */
#define PMC_SRAMCTRL1_RAMBLESEQL_LS(x)           (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT)) & PMC_SRAMCTRL1_RAMBLESEQL_LS_MASK)

#define PMC_SRAMCTRL1_RAMBLESEQL_DSB_MASK        (0x20U)
#define PMC_SRAMCTRL1_RAMBLESEQL_DSB_SHIFT       (5U)
/*! RAMBLESEQL_DSB - RAM BLE Sequencer Deep sleep mode */
#define PMC_SRAMCTRL1_RAMBLESEQL_DSB(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLESEQL_DSB_SHIFT)) & PMC_SRAMCTRL1_RAMBLESEQL_DSB_MASK)

#define PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_MASK     (0x40U)
#define PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_SHIFT    (6U)
/*! RAMBLESEQL_DSBDEL - RAM BLE Sequencer Deep sleep delayed */
#define PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL(x)       (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_SHIFT)) & PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_MASK)

#define PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_MASK      (0x80U)
#define PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_SHIFT     (7U)
/*! RAMBLESEQL_LSDEL - RAMBLE Sequencer Sleep mode disable */
#define PMC_SRAMCTRL1_RAMBLESEQL_LSDEL(x)        (((uint32_t)(((uint32_t)(x)) << PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_SHIFT)) & PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_MASK)
/*! @} */

/*! @name SRAMASSISTCTRL0 - SRAMASSISTCTRL0 */
/*! @{ */

#define PMC_SRAMASSISTCTRL0_RAM_SRAM_MASK        (0x6U)
#define PMC_SRAMASSISTCTRL0_RAM_SRAM_SHIFT       (1U)
/*! RAM_SRAM - Read Assist Margin */
#define PMC_SRAMASSISTCTRL0_RAM_SRAM(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMASSISTCTRL0_RAM_SRAM_SHIFT)) & PMC_SRAMASSISTCTRL0_RAM_SRAM_MASK)

#define PMC_SRAMASSISTCTRL0_WAM_SRAM_MASK        (0x38U)
#define PMC_SRAMASSISTCTRL0_WAM_SRAM_SHIFT       (3U)
/*! WAM_SRAM - Write Assist Margin */
#define PMC_SRAMASSISTCTRL0_WAM_SRAM(x)          (((uint32_t)(((uint32_t)(x)) << PMC_SRAMASSISTCTRL0_WAM_SRAM_SHIFT)) & PMC_SRAMASSISTCTRL0_WAM_SRAM_MASK)
/*! @} */

/*! @name SRAMASSISTCTRL1 - SRAMASSISTCTRL1 */
/*! @{ */

#define PMC_SRAMASSISTCTRL1_RAM_SRAM_BLE_MASK    (0x6U)
#define PMC_SRAMASSISTCTRL1_RAM_SRAM_BLE_SHIFT   (1U)
/*! RAM_SRAM_BLE - Read Assist Margin */
#define PMC_SRAMASSISTCTRL1_RAM_SRAM_BLE(x)      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMASSISTCTRL1_RAM_SRAM_BLE_SHIFT)) & PMC_SRAMASSISTCTRL1_RAM_SRAM_BLE_MASK)

#define PMC_SRAMASSISTCTRL1_WAM_SRAM_BLE_MASK    (0x38U)
#define PMC_SRAMASSISTCTRL1_WAM_SRAM_BLE_SHIFT   (3U)
/*! WAM_SRAM_BLE - Write Assist Margin */
#define PMC_SRAMASSISTCTRL1_WAM_SRAM_BLE(x)      (((uint32_t)(((uint32_t)(x)) << PMC_SRAMASSISTCTRL1_WAM_SRAM_BLE_SHIFT)) & PMC_SRAMASSISTCTRL1_WAM_SRAM_BLE_MASK)
/*! @} */

/*! @name DFTENDIS - DFTENDIS */
/*! @{ */

#define PMC_DFTENDIS_CORE_OK_MASK                (0x1U)
#define PMC_DFTENDIS_CORE_OK_SHIFT               (0U)
/*! CORE_OK - Accessible only through DFT */
#define PMC_DFTENDIS_CORE_OK(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_CORE_OK_SHIFT)) & PMC_DFTENDIS_CORE_OK_MASK)

#define PMC_DFTENDIS_WUP_TEST_MASK               (0x2U)
#define PMC_DFTENDIS_WUP_TEST_SHIFT              (1U)
/*! WUP_TEST - Accessible only through DFT */
#define PMC_DFTENDIS_WUP_TEST(x)                 (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_WUP_TEST_SHIFT)) & PMC_DFTENDIS_WUP_TEST_MASK)

#define PMC_DFTENDIS_WUP_TEST_SEL_MASK           (0x4U)
#define PMC_DFTENDIS_WUP_TEST_SEL_SHIFT          (2U)
/*! WUP_TEST_SEL - Accessible only through DFT */
#define PMC_DFTENDIS_WUP_TEST_SEL(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_WUP_TEST_SEL_SHIFT)) & PMC_DFTENDIS_WUP_TEST_SEL_MASK)

#define PMC_DFTENDIS_BG_TEST_EN_MASK             (0x8U)
#define PMC_DFTENDIS_BG_TEST_EN_SHIFT            (3U)
/*! BG_TEST_EN - Accessible only through DFT */
#define PMC_DFTENDIS_BG_TEST_EN(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BG_TEST_EN_SHIFT)) & PMC_DFTENDIS_BG_TEST_EN_MASK)

#define PMC_DFTENDIS_LDOAO_TEST_DIS_MASK         (0x10U)
#define PMC_DFTENDIS_LDOAO_TEST_DIS_SHIFT        (4U)
/*! LDOAO_TEST_DIS - Accessible only through DFT */
#define PMC_DFTENDIS_LDOAO_TEST_DIS(x)           (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_LDOAO_TEST_DIS_SHIFT)) & PMC_DFTENDIS_LDOAO_TEST_DIS_MASK)

#define PMC_DFTENDIS_BUFFER_EN_MASK              (0x20U)
#define PMC_DFTENDIS_BUFFER_EN_SHIFT             (5U)
/*! BUFFER_EN - Accessible only through DFT */
#define PMC_DFTENDIS_BUFFER_EN(x)                (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BUFFER_EN_SHIFT)) & PMC_DFTENDIS_BUFFER_EN_MASK)

#define PMC_DFTENDIS_PD_PMC_MASK                 (0x40U)
#define PMC_DFTENDIS_PD_PMC_SHIFT                (6U)
/*! PD_PMC - Accessible only through DFT */
#define PMC_DFTENDIS_PD_PMC(x)                   (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_PD_PMC_SHIFT)) & PMC_DFTENDIS_PD_PMC_MASK)

#define PMC_DFTENDIS_SWCTRL_S4_MASK              (0x80U)
#define PMC_DFTENDIS_SWCTRL_S4_SHIFT             (7U)
/*! SWCTRL_S4 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S4(x)                (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S4_SHIFT)) & PMC_DFTENDIS_SWCTRL_S4_MASK)

#define PMC_DFTENDIS_SWCTRL_S5a_MASK             (0x100U)
#define PMC_DFTENDIS_SWCTRL_S5a_SHIFT            (8U)
/*! SWCTRL_S5a - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S5a(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S5a_SHIFT)) & PMC_DFTENDIS_SWCTRL_S5a_MASK)

