zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_DFTENDIS_SWCTRL_S5b_MASK             (0x200U)
#define PMC_DFTENDIS_SWCTRL_S5b_SHIFT            (9U)
/*! SWCTRL_S5b - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S5b(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S5b_SHIFT)) & PMC_DFTENDIS_SWCTRL_S5b_MASK)

#define PMC_DFTENDIS_SWCTRL_S9_MASK              (0x400U)
#define PMC_DFTENDIS_SWCTRL_S9_SHIFT             (10U)
/*! SWCTRL_S9 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S9(x)                (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S9_SHIFT)) & PMC_DFTENDIS_SWCTRL_S9_MASK)

#define PMC_DFTENDIS_SWCTRL_S10_MASK             (0x800U)
#define PMC_DFTENDIS_SWCTRL_S10_SHIFT            (11U)
/*! SWCTRL_S10 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S10(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S10_SHIFT)) & PMC_DFTENDIS_SWCTRL_S10_MASK)

#define PMC_DFTENDIS_SWCTRL_S11_MASK             (0x1000U)
#define PMC_DFTENDIS_SWCTRL_S11_SHIFT            (12U)
/*! SWCTRL_S11 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S11(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S11_SHIFT)) & PMC_DFTENDIS_SWCTRL_S11_MASK)

#define PMC_DFTENDIS_SWCTRL_S12_MASK             (0x2000U)
#define PMC_DFTENDIS_SWCTRL_S12_SHIFT            (13U)
/*! SWCTRL_S12 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S12(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S12_SHIFT)) & PMC_DFTENDIS_SWCTRL_S12_MASK)

#define PMC_DFTENDIS_SWCTRL_S12rom_MASK          (0x4000U)
#define PMC_DFTENDIS_SWCTRL_S12rom_SHIFT         (14U)
/*! SWCTRL_S12rom - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S12rom(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S12rom_SHIFT)) & PMC_DFTENDIS_SWCTRL_S12rom_MASK)

#define PMC_DFTENDIS_SWCTRL_S13_MASK             (0x8000U)
#define PMC_DFTENDIS_SWCTRL_S13_SHIFT            (15U)
/*! SWCTRL_S13 - Accessible only through DFT */
#define PMC_DFTENDIS_SWCTRL_S13(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_SWCTRL_S13_SHIFT)) & PMC_DFTENDIS_SWCTRL_S13_MASK)

#define PMC_DFTENDIS_LP_MODE_FORCE_MASK          (0x10000U)
#define PMC_DFTENDIS_LP_MODE_FORCE_SHIFT         (16U)
/*! LP_MODE_FORCE - Accessible only through DFT */
#define PMC_DFTENDIS_LP_MODE_FORCE(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_LP_MODE_FORCE_SHIFT)) & PMC_DFTENDIS_LP_MODE_FORCE_MASK)

#define PMC_DFTENDIS_BLE_DIGCLKEN_MASK           (0x20000U)
#define PMC_DFTENDIS_BLE_DIGCLKEN_SHIFT          (17U)
/*! BLE_DIGCLKEN - Accessible only through DFT */
#define PMC_DFTENDIS_BLE_DIGCLKEN(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BLE_DIGCLKEN_SHIFT)) & PMC_DFTENDIS_BLE_DIGCLKEN_MASK)

#define PMC_DFTENDIS_BLE_STBYEN_MASK             (0x40000U)
#define PMC_DFTENDIS_BLE_STBYEN_SHIFT            (18U)
/*! BLE_STBYEN - Accessible only through DFT */
#define PMC_DFTENDIS_BLE_STBYEN(x)               (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BLE_STBYEN_SHIFT)) & PMC_DFTENDIS_BLE_STBYEN_MASK)

#define PMC_DFTENDIS_PORHV_VSTRESS_EN_MASK       (0x80000U)
#define PMC_DFTENDIS_PORHV_VSTRESS_EN_SHIFT      (19U)
/*! PORHV_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_PORHV_VSTRESS_EN(x)         (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_PORHV_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_PORHV_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_PORLV_VSTRESS_EN_MASK       (0x100000U)
#define PMC_DFTENDIS_PORLV_VSTRESS_EN_SHIFT      (20U)
/*! PORLV_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_PORLV_VSTRESS_EN(x)         (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_PORLV_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_PORLV_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_BG_STRESS_EN_MASK           (0x200000U)
#define PMC_DFTENDIS_BG_STRESS_EN_SHIFT          (21U)
/*! BG_STRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_BG_STRESS_EN(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BG_STRESS_EN_SHIFT)) & PMC_DFTENDIS_BG_STRESS_EN_MASK)

#define PMC_DFTENDIS_BOD1_VSTRESS_EN_MASK        (0x400000U)
#define PMC_DFTENDIS_BOD1_VSTRESS_EN_SHIFT       (22U)
/*! BOD1_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_BOD1_VSTRESS_EN(x)          (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BOD1_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_BOD1_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_BOD2_VSTRESS_EN_MASK        (0x800000U)
#define PMC_DFTENDIS_BOD2_VSTRESS_EN_SHIFT       (23U)
/*! BOD2_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_BOD2_VSTRESS_EN(x)          (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BOD2_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_BOD2_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_DCDC_VSTRESS_EN_MASK        (0x1000000U)
#define PMC_DFTENDIS_DCDC_VSTRESS_EN_SHIFT       (24U)
/*! DCDC_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_DCDC_VSTRESS_EN(x)          (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_DCDC_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_DCDC_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_FRO1M_VSTRESS_EN_MASK       (0x2000000U)
#define PMC_DFTENDIS_FRO1M_VSTRESS_EN_SHIFT      (25U)
/*! FRO1M_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_FRO1M_VSTRESS_EN(x)         (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_FRO1M_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_FRO1M_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_FRO32K_VSTRESS_EN_MASK      (0x4000000U)
#define PMC_DFTENDIS_FRO32K_VSTRESS_EN_SHIFT     (26U)
/*! FRO32K_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_FRO32K_VSTRESS_EN(x)        (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_FRO32K_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_FRO32K_VSTRESS_EN_MASK)

#define PMC_DFTENDIS_XO32_CAPTEST_VSTRESS_EN_MASK (0x8000000U)
#define PMC_DFTENDIS_XO32_CAPTEST_VSTRESS_EN_SHIFT (27U)
/*! XO32_CAPTEST_VSTRESS_EN - Accessible only through DFT */
#define PMC_DFTENDIS_XO32_CAPTEST_VSTRESS_EN(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_XO32_CAPTEST_VSTRESS_EN_SHIFT)) & PMC_DFTENDIS_XO32_CAPTEST_VSTRESS_EN_MASK)

