zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_0_MASK (0x10000000U)
#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_0_SHIFT (28U)
/*! FRO192M_VSTRESS_CTRL_0 - Accessible only through DFT */
#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_0(x)   (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_0_SHIFT)) & PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_0_MASK)

#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_1_MASK (0x20000000U)
#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_1_SHIFT (29U)
/*! FRO192M_VSTRESS_CTRL_1 - Accessible only through DFT */
#define PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_1(x)   (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_1_SHIFT)) & PMC_DFTENDIS_FRO192M_VSTRESS_CTRL_1_MASK)

#define PMC_DFTENDIS_BLE_EXT_SPI_SEL_MASK        (0x40000000U)
#define PMC_DFTENDIS_BLE_EXT_SPI_SEL_SHIFT       (30U)
/*! BLE_EXT_SPI_SEL - Accessible only through DFT */
#define PMC_DFTENDIS_BLE_EXT_SPI_SEL(x)          (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BLE_EXT_SPI_SEL_SHIFT)) & PMC_DFTENDIS_BLE_EXT_SPI_SEL_MASK)

#define PMC_DFTENDIS_BLE_OSCTSTEN_MASK           (0x80000000U)
#define PMC_DFTENDIS_BLE_OSCTSTEN_SHIFT          (31U)
/*! BLE_OSCTSTEN - Accessible only through DFT */
#define PMC_DFTENDIS_BLE_OSCTSTEN(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTENDIS_BLE_OSCTSTEN_SHIFT)) & PMC_DFTENDIS_BLE_OSCTSTEN_MASK)
/*! @} */

/*! @name DFTDCDC - DFTDCDC */
/*! @{ */

#define PMC_DFTDCDC_DCDC_SW_EN_MASK              (0x1U)
#define PMC_DFTDCDC_DCDC_SW_EN_SHIFT             (0U)
/*! DCDC_SW_EN - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_SW_EN(x)                (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_SW_EN_SHIFT)) & PMC_DFTDCDC_DCDC_SW_EN_MASK)

#define PMC_DFTDCDC_DCDC0_TEST_EN_MASK           (0x2U)
#define PMC_DFTDCDC_DCDC0_TEST_EN_SHIFT          (1U)
/*! DCDC0_TEST_EN - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC0_TEST_EN(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC0_TEST_EN_SHIFT)) & PMC_DFTDCDC_DCDC0_TEST_EN_MASK)

#define PMC_DFTDCDC_DCDC_TEST_SEL_0_MASK         (0x4U)
#define PMC_DFTDCDC_DCDC_TEST_SEL_0_SHIFT        (2U)
/*! DCDC_TEST_SEL_0 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_TEST_SEL_0(x)           (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_TEST_SEL_0_SHIFT)) & PMC_DFTDCDC_DCDC_TEST_SEL_0_MASK)

#define PMC_DFTDCDC_DCDC_TEST_SEL_1_MASK         (0x8U)
#define PMC_DFTDCDC_DCDC_TEST_SEL_1_SHIFT        (3U)
/*! DCDC_TEST_SEL_1 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_TEST_SEL_1(x)           (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_TEST_SEL_1_SHIFT)) & PMC_DFTDCDC_DCDC_TEST_SEL_1_MASK)

#define PMC_DFTDCDC_DCDC_TEST_SEL_2_MASK         (0x10U)
#define PMC_DFTDCDC_DCDC_TEST_SEL_2_SHIFT        (4U)
/*! DCDC_TEST_SEL_2 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_TEST_SEL_2(x)           (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_TEST_SEL_2_SHIFT)) & PMC_DFTDCDC_DCDC_TEST_SEL_2_MASK)

#define PMC_DFTDCDC_DCDC_SPARE_0_MASK            (0x20U)
#define PMC_DFTDCDC_DCDC_SPARE_0_SHIFT           (5U)
/*! DCDC_SPARE_0 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_SPARE_0(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_SPARE_0_SHIFT)) & PMC_DFTDCDC_DCDC_SPARE_0_MASK)

#define PMC_DFTDCDC_DCDC_SPARE_1_MASK            (0x40U)
#define PMC_DFTDCDC_DCDC_SPARE_1_SHIFT           (6U)
/*! DCDC_SPARE_1 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_SPARE_1(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_SPARE_1_SHIFT)) & PMC_DFTDCDC_DCDC_SPARE_1_MASK)

#define PMC_DFTDCDC_DCDC_SPARE_2_MASK            (0x80U)
#define PMC_DFTDCDC_DCDC_SPARE_2_SHIFT           (7U)
/*! DCDC_SPARE_2 - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_SPARE_2(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_SPARE_2_SHIFT)) & PMC_DFTDCDC_DCDC_SPARE_2_MASK)

#define PMC_DFTDCDC_DCDC_INRUSH_BYP_LV_MASK      (0x100U)
#define PMC_DFTDCDC_DCDC_INRUSH_BYP_LV_SHIFT     (8U)
/*! DCDC_INRUSH_BYP_LV - Accessible only through DFT */
#define PMC_DFTDCDC_DCDC_INRUSH_BYP_LV(x)        (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_DCDC_INRUSH_BYP_LV_SHIFT)) & PMC_DFTDCDC_DCDC_INRUSH_BYP_LV_MASK)

#define PMC_DFTDCDC_BOD_CONNECT1_MASK            (0x200U)
#define PMC_DFTDCDC_BOD_CONNECT1_SHIFT           (9U)
/*! BOD_CONNECT1 - Accessible only through DFT */
#define PMC_DFTDCDC_BOD_CONNECT1(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BOD_CONNECT1_SHIFT)) & PMC_DFTDCDC_BOD_CONNECT1_MASK)

#define PMC_DFTDCDC_BOD_CONNECT2_MASK            (0x400U)
#define PMC_DFTDCDC_BOD_CONNECT2_SHIFT           (10U)
/*! BOD_CONNECT2 - Accessible only through DFT */
#define PMC_DFTDCDC_BOD_CONNECT2(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BOD_CONNECT2_SHIFT)) & PMC_DFTDCDC_BOD_CONNECT2_MASK)

#define PMC_DFTDCDC_LDOD_ENA_HPM_MASK            (0x800U)
#define PMC_DFTDCDC_LDOD_ENA_HPM_SHIFT           (11U)
/*! LDOD_ENA_HPM - Accessible only through DFT */
#define PMC_DFTDCDC_LDOD_ENA_HPM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_LDOD_ENA_HPM_SHIFT)) & PMC_DFTDCDC_LDOD_ENA_HPM_MASK)

#define PMC_DFTDCDC_LDOD_ENA_LPM_MASK            (0x1000U)
#define PMC_DFTDCDC_LDOD_ENA_LPM_SHIFT           (12U)
/*! LDOD_ENA_LPM - Accessible only through DFT */
#define PMC_DFTDCDC_LDOD_ENA_LPM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_LDOD_ENA_LPM_SHIFT)) & PMC_DFTDCDC_LDOD_ENA_LPM_MASK)

#define PMC_DFTDCDC_LDOM_ENA_HPM_MASK            (0x2000U)
#define PMC_DFTDCDC_LDOM_ENA_HPM_SHIFT           (13U)
/*! LDOM_ENA_HPM - Accessible only through DFT */
#define PMC_DFTDCDC_LDOM_ENA_HPM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_LDOM_ENA_HPM_SHIFT)) & PMC_DFTDCDC_LDOM_ENA_HPM_MASK)

#define PMC_DFTDCDC_LDOM_ENA_LPM_MASK            (0x4000U)
#define PMC_DFTDCDC_LDOM_ENA_LPM_SHIFT           (14U)
/*! LDOM_ENA_LPM - Accessible only through DFT */
#define PMC_DFTDCDC_LDOM_ENA_LPM(x)              (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_LDOM_ENA_LPM_SHIFT)) & PMC_DFTDCDC_LDOM_ENA_LPM_MASK)

#define PMC_DFTDCDC_BG_EN_MASK                   (0x8000U)
#define PMC_DFTDCDC_BG_EN_SHIFT                  (15U)
/*! BG_EN - Accessible only through DFT */
#define PMC_DFTDCDC_BG_EN(x)                     (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BG_EN_SHIFT)) & PMC_DFTDCDC_BG_EN_MASK)

#define PMC_DFTDCDC_BG_LP_VREF_SW_MASK           (0x10000U)
#define PMC_DFTDCDC_BG_LP_VREF_SW_SHIFT          (16U)
/*! BG_LP_VREF_SW - Accessible only through DFT */
#define PMC_DFTDCDC_BG_LP_VREF_SW(x)             (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BG_LP_VREF_SW_SHIFT)) & PMC_DFTDCDC_BG_LP_VREF_SW_MASK)

