zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_DFTDCDC_BG_HP_EN_MASK                (0x20000U)
#define PMC_DFTDCDC_BG_HP_EN_SHIFT               (17U)
/*! BG_HP_EN - Accessible only through DFT */
#define PMC_DFTDCDC_BG_HP_EN(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BG_HP_EN_SHIFT)) & PMC_DFTDCDC_BG_HP_EN_MASK)

#define PMC_DFTDCDC_BLE_DSLP_MASK                (0x40000U)
#define PMC_DFTDCDC_BLE_DSLP_SHIFT               (18U)
/*! BLE_DSLP - Accessible only through DFT */
#define PMC_DFTDCDC_BLE_DSLP(x)                  (((uint32_t)(((uint32_t)(x)) << PMC_DFTDCDC_BLE_DSLP_SHIFT)) & PMC_DFTDCDC_BLE_DSLP_MASK)
/*! @} */

/*! @name DFTCAPTEST - DFTCAPTEST */
/*! @{ */

#define PMC_DFTCAPTEST_XO32_CAPTEST_EN_MASK      (0x1U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_EN_SHIFT     (0U)
/*! XO32_CAPTEST_EN - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_EN(x)        (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_EN_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_EN_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_OSC_IN_MASK  (0x2U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_OSC_IN_SHIFT (1U)
/*! XO32_CAPTEST_OSC_IN - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_OSC_IN(x)    (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_OSC_IN_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_OSC_IN_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_0_MASK (0x8U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_0_SHIFT (3U)
/*! XO32_CAPTEST_CNTVAL_0 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_0(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_0_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_0_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_1_MASK (0x10U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_1_SHIFT (4U)
/*! XO32_CAPTEST_CNTVAL_1 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_1(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_1_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_1_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_2_MASK (0x20U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_2_SHIFT (5U)
/*! XO32_CAPTEST_CNTVAL_2 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_2(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_2_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_2_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_3_MASK (0x40U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_3_SHIFT (6U)
/*! XO32_CAPTEST_CNTVAL_3 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_3(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_3_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_3_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_4_MASK (0x80U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_4_SHIFT (7U)
/*! XO32_CAPTEST_CNTVAL_4 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_4(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_4_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_4_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_5_MASK (0x100U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_5_SHIFT (8U)
/*! XO32_CAPTEST_CNTVAL_5 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_5(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_5_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_5_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_6_MASK (0x200U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_6_SHIFT (9U)
/*! XO32_CAPTEST_CNTVAL_6 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_6(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_6_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_6_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_7_MASK (0x400U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_7_SHIFT (10U)
/*! XO32_CAPTEST_CNTVAL_7 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_7(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_7_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_7_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_8_MASK (0x800U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_8_SHIFT (11U)
/*! XO32_CAPTEST_CNTVAL_8 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_8(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_8_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_8_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_9_MASK (0x1000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_9_SHIFT (12U)
/*! XO32_CAPTEST_CNTVAL_9 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_9(x)  (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_9_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_9_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_10_MASK (0x2000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_10_SHIFT (13U)
/*! XO32_CAPTEST_CNTVAL_10 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_10(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_10_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_10_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_11_MASK (0x4000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_11_SHIFT (14U)
/*! XO32_CAPTEST_CNTVAL_11 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_11(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_11_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_11_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_12_MASK (0x8000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_12_SHIFT (15U)
/*! XO32_CAPTEST_CNTVAL_12 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_12(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_12_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_12_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_13_MASK (0x10000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_13_SHIFT (16U)
/*! XO32_CAPTEST_CNTVAL_13 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_13(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_13_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_13_MASK)

#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_14_MASK (0x20000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_14_SHIFT (17U)
/*! XO32_CAPTEST_CNTVAL_14 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_14(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_14_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_14_MASK)

