zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph4/PERI_PMC.h
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_15_MASK (0x40000U)
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_15_SHIFT (18U)
/*! XO32_CAPTEST_CNTVAL_15 - Accessible only through DFT */
#define PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_15(x) (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_15_SHIFT)) & PMC_DFTCAPTEST_XO32_CAPTEST_CNTVAL_15_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_0_MASK          (0x100000U)
#define PMC_DFTCAPTEST_COT_VALUE_0_SHIFT         (20U)
/*! COT_VALUE_0 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_0(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_0_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_0_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_1_MASK          (0x200000U)
#define PMC_DFTCAPTEST_COT_VALUE_1_SHIFT         (21U)
/*! COT_VALUE_1 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_1(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_1_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_1_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_2_MASK          (0x400000U)
#define PMC_DFTCAPTEST_COT_VALUE_2_SHIFT         (22U)
/*! COT_VALUE_2 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_2(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_2_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_2_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_3_MASK          (0x800000U)
#define PMC_DFTCAPTEST_COT_VALUE_3_SHIFT         (23U)
/*! COT_VALUE_3 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_3(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_3_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_3_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_4_MASK          (0x1000000U)
#define PMC_DFTCAPTEST_COT_VALUE_4_SHIFT         (24U)
/*! COT_VALUE_4 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_4(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_4_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_4_MASK)

#define PMC_DFTCAPTEST_COT_VALUE_5_MASK          (0x2000000U)
#define PMC_DFTCAPTEST_COT_VALUE_5_SHIFT         (25U)
/*! COT_VALUE_5 - Accessible only through DFT */
#define PMC_DFTCAPTEST_COT_VALUE_5(x)            (((uint32_t)(((uint32_t)(x)) << PMC_DFTCAPTEST_COT_VALUE_5_SHIFT)) & PMC_DFTCAPTEST_COT_VALUE_5_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group PMC_Register_Masks */


/*!
 * @}
 */ /* end of group PMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_PMC_H_ */

